{
  "BNS S. 1": "Short title, commencement, and territorial application of the Act.\n\nExplanation: The Act consolidates provisions related to offenses, effective from a date appointed by the Central Government. It applies to any person, including those committing offenses outside India under specific circumstances, such as targeting Indian resources.\n\nIllustration: A, a citizen of India, commits murder outside India. He can be tried for murder in India as if the crime were committed within India.\n\nEffect: The Bharatiya Nyaya Sanhita, 2023, applies to all offenses within India and specific extraterritorial crimes. No other law related to mutiny, desertion, or special laws is affected.",
  "BNS S. 2": "To provide definitions of key terms used in the Act.\n\nExplanation: Defines terms such as \"act,\" \"animal,\" \"counterfeit,\" \"Court,\" \"death,\" \"dishonestly,\" \"document,\" and others to ensure clarity and uniform interpretation of the law.\n\nIllustration: A cheque is considered a document as it may serve as evidence of a transaction.\n\nEffect: Ensures consistency and avoids ambiguity in interpreting the Act.",
  "BNS S. 3": "To provide clarity and exceptions to definitions and liabilities.\n\nExplanation: Definitions of offences, penal provisions, and illustrations must be read subject to \"General Exceptions,\" ensure uniformity of terms, encompass acts and omissions, and establish liability for joint actions or shared intent.\n\nIllustration: A child under seven cannot commit offences due to the general exception; joint jailors A and B are both guilty of murder due to their shared intent.\n\nEffect: Ensures comprehensive understanding of offences, consistent terminology, accountability for omissions, and appropriate liability based on intent and action.",
  "BNS S. 4(53)": "The punishments to which offenders are liable under the provisions of this Sanhita.\n\nExplanation: This section outlines the types of punishments applicable under the Bharatiya Nyaya Sanhita.\n\nIllustration: The punishments include: Death, Imprisonment for life, Imprisonment (rigorous and simple), Forfeiture of property, Fine, and Community Service.\n\nEffect: Specifies the range of punishments offenders can face under the Act.",
  "BNS S. 5": "The appropriate Government may, without the consent of the offender, commute any punishment under this Sanhita to any other punishment in accordance with section 474 of the Bharatiya Nagarik Suraksha Sanhita, 2023.\n\nExplanation: This section allows the commutation of a sentence by the appropriate Government, which is defined based on the nature of the offence.\n\nIllustration: The appropriate Government may commute a punishment to any other punishment without the offender’s consent.\n\nEffect: Enables the commutation of a sentence by the appropriate Government, depending on jurisdiction.",
  "BNS S. 6": "In calculating fractions of terms of punishment, imprisonment for life shall be reckoned as equivalent to imprisonment for twenty years unless otherwise provided.\n\nExplanation: This section clarifies how fractions of terms of punishment are to be calculated, specifically for imprisonment for life.\n\nIllustration: Imprisonment for life is treated as equivalent to twenty years unless otherwise specified.\n\nEffect: Establishes the rule for calculating fractions of life imprisonment terms.",
  "BNS S. 7": "The appropriate Government may, without the consent of the offender, commute any punishment under this Sanhita to any other punishment in accordance with section 474 of the Bharatiya Nagarik Suraksha Sanhita, 2023.\n\nExplanation: This section allows the commutation of a sentence by the appropriate Government, which is defined based on the nature of the offence.\n\nIllustration: The appropriate Government may commute a punishment to any other punishment without the offender’s consent.\n\nEffect: Enables the commutation of a sentence by the appropriate Government, depending on jurisdiction.",
  "BNS S. 8(63, 64, 65, 66, 67, 68, 69, 70)": "The section outlines the amount of fine, default imprisonment, and terms for defaulting on payment of fines.\n\nExplanation: Defines the amount of fine and liability for default payment, including details on imprisonment terms for non-payment and how fines may be levied.\n\nIllustration: A is sentenced to a fine of one thousand rupees and four months’ imprisonment in default. If seven hundred and fifty rupees are paid before one month of imprisonment, A will be discharged.\n\nEffect: Establishes procedures for fines and imprisonment terms for non-payment, including conditions for termination of imprisonment based on payment.",
  "BNS S. 9": "The section limits the punishment for multiple offences that constitute a single act or offence, unless explicitly stated otherwise.\n\nExplanation: If an act consists of several parts, any of which is an offence, the offender is not punished for more than one of those offences unless expressly stated.\n\nIllustration: A gives Z fifty strokes with a stick. A is only punished for the whole beating, not for each individual blow. However, if A strikes Y while beating Z, A is liable for two separate offences—one for Z and one for Y.\n\nEffect: Limits multiple punishments for offences that make up a single act, ensuring the offender isn't punished multiple times for related actions unless specified.",
  "BNS S. 10": "The section outlines how a person should be punished when it is uncertain which of several offences they are guilty of.\n\nExplanation: If the judgment is unclear about which offence the offender committed, the offender will be punished with the lowest punishment for any of the possible offences, provided the same punishment is not specified for all.\n\nIllustration: If it is uncertain whether an offender committed offence A or offence B, and the punishment for offence A is lighter than for offence B, the offender will receive the punishment for offence A.\n\nEffect: Ensures the offender is given the least severe punishment in cases of uncertainty about which offence was committed.",
  "BNS S. 11": "The section allows for solitary confinement as part of the sentence for certain offences involving rigorous imprisonment.\n\nExplanation: If a person is convicted of an offence punishable by rigorous imprisonment, the Court may order solitary confinement for a portion of the sentence, with limits based on the length of the imprisonment.\n\nIllustration: If the imprisonment is less than six months, solitary confinement may last up to one month. If the imprisonment exceeds six months but not one year, it can last up to two months, and up to three months for terms exceeding one year.\n\nEffect: Provides the Court with the authority to impose solitary confinement as part of the sentence for certain offences, within defined limits.",
  "BNS S. 12": "The section places limits on the duration of solitary confinement during imprisonment.\n\nExplanation: Solitary confinement cannot exceed fourteen days at a time, and there must be intervals of at least the same length. If imprisonment exceeds three months, solitary confinement is limited to seven days per month, with similar intervals between periods.\n\nIllustration: If an offender is sentenced to six months in prison, solitary confinement cannot exceed fourteen days at once, and there must be intervals of at least fourteen days between each period of solitary confinement.\n\nEffect: Ensures that solitary confinement is used within strict limits to avoid excessive isolation.",
  "BNS S. 13": "The section provides for enhanced punishment for repeat offenders convicted under specific chapters.\n\nExplanation: If a person is convicted of an offence punishable under Chapters X or XVII with imprisonment of three years or more, and later commits a similar offence, they face enhanced punishment, including life imprisonment or a term of up to ten years.\n\nIllustration: If someone convicted of an offence under Chapters X or XVII of the Sanhita is later convicted again for a similar offence, they will face life imprisonment or a term of up to ten years.\n\nEffect: Establishes stricter penalties for repeat offenders to deter further criminal activity.",
  "BNS S. 14(76)": "The section exempts a person from liability if they act under a legal obligation or due to a genuine mistake of fact.\n\nExplanation: If a person acts under a mistake of fact, in good faith, believing themselves to be bound by law, they do not commit an offence.\n\nIllustration: A soldier fires on a mob by order of his superior officer, believing it is lawful. A has committed no offence. A court officer arrests Z after mistakenly believing Z is the person they are ordered to arrest.\n\nEffect: Protects individuals from criminal liability if they act in good faith under the belief that they are legally bound to do so.",
  "BNS S. 15(77)": "The section shields a Judge from liability when acting in their judicial capacity under the belief that their actions are legally authorized.\n\nExplanation: A Judge is not guilty of an offence when performing their judicial duties in good faith, based on their belief that the law grants them such authority.\n\nIllustration: A Judge makes a ruling, believing it to be in line with the law, and is not held liable for the decision even if later found incorrect.\n\nEffect: Protects Judges from criminal responsibility for acts done in the course of their judicial duties, as long as they act in good faith.",
  "BNS S. 16(78)": "The section exempts from liability any act done in pursuance of a Court’s judgment or order, even if the Court lacked jurisdiction, provided the person acted in good faith.\n\nExplanation: An act done following a Court’s judgment or order is not an offence if the person believed in good faith that the Court had jurisdiction, even if the Court did not have jurisdiction.\n\nIllustration: A person acts based on a Court order, believing the Court had jurisdiction, and the act is not an offence despite the lack of jurisdiction.\n\nEffect: Protects individuals from liability when acting under a Court’s order or judgment, provided they act in good faith.",
  "BNS S. 17(79)": "This section exempts individuals from liability if they act in accordance with the law or in good faith, believing they are justified by law.\n\nExplanation: If a person, acting in good faith, believes they are justified by law to take certain actions, they are not guilty of an offence.\n\nIllustration: A, in good faith, apprehends Z, believing Z is committing a murder, but Z was acting in self-defence. A has committed no offence.\n\nEffect: Shields individuals from liability when they believe they are legally justified in their actions.",
  "BNS S. 18(80)": "The section protects individuals from liability if they cause harm accidentally while performing a lawful act with care.\n\nExplanation: If harm occurs unintentionally while performing a lawful act in a lawful manner with proper care, no offence is committed.\n\nIllustration: A accidentally kills someone while working with a hatchet, but there was no negligence. A is not guilty of an offence.\n\nEffect: Exempts individuals from liability for accidents during lawful acts, as long as no criminal intent or negligence is involved.",
  "BNS S. 19(81)": "This section protects individuals from liability if they cause harm while attempting to prevent greater harm, without criminal intent.\n\nExplanation: If harm is caused without criminal intent while trying to prevent a greater harm, it is not an offence, provided the harm was justified.\n\nIllustration: A changes the course of a vessel to avoid running down a boat with more passengers, even though it risks running down a smaller boat. A is not guilty if the danger was imminent and justified the risk.\n\nEffect: Provides a defence for individuals who cause harm to avoid greater harm in good faith.",
  "BNS S. 20(82)": "A child under the age of seven is exempt from criminal liability for their actions.\n\nExplanation: A child under seven years old cannot be held guilty of committing an offence.\n\nIllustration: A child under seven accidentally breaks something but cannot be held criminally responsible for the act.\n\nEffect: Protects children under seven from criminal liability.",
  "BNS S. 21(83)": "Act of a child above seven and under twelve of immature understanding\n\nExplanation: A child above seven but under twelve who lacks maturity of understanding\n\nIllustration: A child aged between seven and twelve is not guilty of an offence if they lack sufficient maturity to understand the nature and consequences of their actions.\n\nEffect: A child of 9 who lacks the understanding of the consequences of their actions is not guilty of an offence they committed.",
  "BNS S. 22(84)": "Act of a person of unsound mind\n\nExplanation: Mental illness preventing the person from understanding the nature or wrongfulness of the act\n\nIllustration: A person with a mental illness that prevents them from understanding the nature of their actions or knowing they are wrong is not guilty of an offence.\n\nEffect: A person with severe mental illness commits an act but is unaware that it is wrong due to their condition.",
  "BNS S. 23(85)": "Act of a person incapable of judgment by reason of intoxication caused against his will\n\nExplanation: Intoxication without consent or knowledge\n\nIllustration: A person who is intoxicated without their knowledge or consent is not guilty of an offence if they cannot understand the nature of their actions due to the intoxication.\n\nEffect: A person unknowingly consumes a substance that intoxicates them and commits an offence without understanding the consequences.",
  "BNS S. 24(86)": "Offence requiring a particular intent or knowledge committed by one who is intoxicated\n\nExplanation: Intoxication during the commission of an offence requiring intent or knowledge\n\nIllustration: A person who commits an offence requiring specific knowledge or intent while intoxicated will be treated as if they had the same knowledge or intent as if they were sober, unless the intoxication was involuntary.\n\nEffect: A person commits a theft while intoxicated but is treated as if they had the intent to steal, as if they were sober, unless the intoxication was involuntary.",
  "BNS S. 25(87)": "Act not intended and not known to be likely to cause death or grievous hurt, done by consent\n\nExplanation: Consent given for acts that do not intend or know to cause death or grievous harm\n\nIllustration: An act not intended to cause death or grievous harm, and not known to likely cause such harm, is not an offence if the person consented to it.\n\nEffect: A and Z agree to fence with each other, and Z gets hurt during the game. A is not guilty as Z consented to the risk of harm.",
  "BNS S. 26(88)": "Act not intended to cause death, done by consent in good faith for person’s benefit\n\nExplanation: Harm caused without intent to cause death, done for the person’s benefit with consent\n\nIllustration: A surgeon performing a high-risk operation for the benefit of a patient, with consent, and without intending death\n\nEffect: Protects individuals from liability when performing acts in good faith for someone’s benefit, as long as death isn't intended.",
  "BNS S. 27(89)": "Act done in good faith for benefit of child or person with unsound mind, by or by consent of guardian\n\nExplanation: Harm caused to a child or mentally ill person in good faith for their benefit\n\nIllustration: A parent authorizing a risky surgery on their child to cure a painful disease, not intending death\n\nEffect: Protects actions performed by a guardian for the benefit of a child or mentally ill person, but not for harmful or life-threatening actions.",
  "BNS S. 28(90)": "Consent known to be given under fear or misconception\n\nExplanation: Consent given under fear or misconception, or by someone incapable of understanding\n\nIllustration: Consent given under fear or misunderstanding is not valid if the person acting knows or should have known\n\nEffect: Protects individuals from liability for actions taken based on invalid consent, such as from fear or misunderstanding.",
  "BNS S. 29(91)": "Exclusion of acts which are offences independently of harm caused\n\nExplanation: Acts that are offences regardless of harm or consent\n\nIllustration: Certain actions, like causing miscarriage, are offences on their own, even if consent is given\n\nEffect: Clarifies that consent is not valid in cases where the act is inherently illegal, regardless of harm or intent.",
  "BNS S. 30(92)": "Act done in good faith for benefit of a person without consent\n\nExplanation: Harm caused to a person for their benefit, without their consent, in urgent circumstances\n\nIllustration: A surgeon performing an urgent operation on an unconscious patient to save their life\n\nEffect: Allows actions in good faith to be taken without consent when it is impossible to obtain consent in time, provided the act is not intentionally harmful.",
  "BNS S. 31(93)": "Communication made in good faith\n\nExplanation: Communication made for the benefit of a person, even if it causes harm\n\nIllustration: A surgeon informs a patient they cannot live, leading to shock and death\n\nEffect: Protects individuals from liability for communications made in good faith for the benefit of the recipient, even if harm results.",
  "BNS S. 32(94)": "Act compelled by threats\n\nExplanation: Act done under threat of instant death, with no reasonable alternative\n\nIllustration: A person forced by dacoits to open a door for a robbery, under threat of death\n\nEffect: Protects individuals from liability for acts done under extreme duress (death threat), provided they did not put themselves in the situation willingly.",
  "BNS S. 33(95)": "Act causing slight harm\n\nExplanation: Harm caused is so minor that no reasonable person would complain\n\nIllustration: A minor scratch during a fight\n\nEffect: Protects minor injuries that no reasonable person would consider offensive or worth legal action.",
  "BNS S. 34(96)": "Things done in private defence\n\nExplanation: Act done while exercising the right to defend oneself or others\n\nIllustration: A person defending themselves from an attacker\n\nEffect: Protects individuals from liability for acts done in self-defense or the defense of others.",
  "BNS S. 35(97)": "Right of private defence of the body and property\n\nExplanation: Right to defend one’s body or property against certain offenses\n\nIllustration: A person defending their house from a robber or their body from an assault\n\nEffect: Recognizes the right to defend oneself, others, and property against theft, robbery, trespassing, etc., within certain limits.",
  "BNS S. 36(98)": "Right of private defence against the act of a person with unsound mind, etc.\n\nExplanation: Right to private defence against acts by individuals who are not criminally liable due to mental illness, intoxication, or misconception.\n\nIllustration: Z, under mental illness, attempts to kill A; A has the right of private defence even though Z is not guilty.\n\nEffect: Extends the right of private defence even when the attacker is not criminally liable due to mental illness, intoxication, or misconception.",
  "BNS S. 37(99)": "Acts against which there is no right of private defence\n\nExplanation: No right of private defence against certain acts by public servants or when there is time to seek help from authorities.\n\nIllustration: A person is attacked by a public servant acting in good faith under the color of his office, and no private defence is allowed.\n\nEffect: No right to private defence against acts that do not cause apprehension of death or grievous hurt by public servants or when authorities can be approached.",
  "BNS S. 38(100)": "When the right of private defence of the body extends to causing death\n\nExplanation: Right of private defence extends to causing death or any harm to the assailant in certain grave situations (e.g., assault with intent to rape or kidnap).\n\nIllustration: A person is assaulted with the intention of committing rape; the victim can defend themselves and cause death to the assailant.\n\nEffect: Protects individuals from liability for causing death or harm to an assailant in specific dangerous situations.",
  "BNS S. 39(101)": "When such right extends to causing any harm other than death\n\nExplanation: Right of private defence extends to causing harm (other than death) to the assailant in cases not covered in Section 38.\n\nIllustration: A person is attacked but does not have to kill the assailant; instead, they may cause harm to defend themselves.\n\nEffect: Allows individuals to cause harm (other than death) to an assailant in situations where the threat is serious but not life-threatening.",
  "BNS S. 40(102)": "Commencement and continuance of the right of private defence of the body\n\nExplanation: Right of private defence starts when there is a reasonable apprehension of danger and continues as long as the threat persists.\n\nIllustration: A person faces a threat of harm, and the right of private defence starts immediately and lasts as long as the danger continues.\n\nEffect: Protects individuals from liability when defending themselves as long as the threat to their body continues.",
  "BNS S. 41(103)": "When the right of private defence of property extends to causing death\n\nExplanation: Right to private defence of property extends to causing death or harm if the property is threatened by certain serious crimes like robbery, house-breaking, mischief, or theft under certain circumstances.\n\nIllustration: A person is defending their property from a robbery and causes the death of the assailant.\n\nEffect: Allows causing death or harm to protect property from serious offences like robbery or house-breaking.",
  "BNS S. 42(104)": "When such right extends to causing any harm other than death\n\nExplanation: Right of private defence of property extends to causing harm other than death for less severe offences such as theft, mischief, or criminal trespass.\n\nIllustration: A person defends their property from theft and harms the thief without causing death.\n\nEffect: Protects property while allowing harm (other than death) to be inflicted for theft or mischief.",
  "BNS S. 43(105)": "Commencement and continuance of the right of private defence of property\n\nExplanation: Right of private defence of property begins when danger to the property is sensed and continues based on the nature of the crime (e.g., till theft is averted or until help from authorities arrives).\n\nIllustration: A person defends against a robbery, and the right continues as long as the assailant poses a threat.\n\nEffect: Ensures the right to defend property continues during a threat and until the danger subsides or authorities intervene.",
  "BNS S. 44(106)": "Right of private defence against deadly assault when there is risk of harm to innocent person\n\nExplanation: If the defender risks harming innocent bystanders while defending against a deadly assault, they can still exercise their right of private defence.\n\nIllustration: A person fires on a mob attacking him, even if it risks harming innocent children in the crowd.\n\nEffect: Protects individuals who must risk harm to innocents while defending against a serious threat.",
  "BNS S. 45(107)": "Abetment of a thing\n\nExplanation: A person abets an act by instigating, conspiring, or aiding it, either before or during the act.\n\nIllustration: B knowingly misrepresents facts to a public officer, leading to the wrongful apprehension of C.\n\nEffect: Holds individuals accountable for instigating, aiding, or conspiring to commit a wrongful act.",
  "BNS S. 46(108)": "Abettor\n\nExplanation: A person abets an offence by instigating, conspiring, or aiding the commission of an act that would be an offence if committed by a legally capable person.\n\nIllustration: A instigates B to commit murder. B fails to do so, but A is still guilty of abetment.\n\nEffect: Holds the abettor accountable even if the act is not committed or the effect of the offence does not occur.",
  "BNS S. 47(108A)": "Abetment in India of offences outside India\n\nExplanation: A person who abets an offence in India but the act is committed outside India is guilty of abetment.\n\nIllustration: A in India instigates B, a foreigner in country X, to commit murder.\n\nEffect: A is guilty of abetting murder, even though it was committed abroad.",
  "BNS S. 48": "Abetment outside India for offence in India\n\nExplanation: A person who abets an offence committed in India, even from outside the country, is guilty of abetment.\n\nIllustration: A, in country X, instigates B to commit a murder in India.\n\nEffect: A is guilty of abetting a murder in India, despite being abroad.",
  "BNS S. 49(109)": "Punishment for abetment when act is committed\n\nExplanation: If the act abetted is committed as a result of the abetment, and there is no specific punishment for abetment, the abettor is punished the same as the person committing the offence.\n\nIllustration: A instigates B to give false evidence. B commits the offence. A is punished as if he had committed the offence himself.\n\nEffect: Punishes the abettor similarly to the person who committed the offence.",
  "BNS S. 50(110)": "Punishment if the abetted person acts with different intention\n\nExplanation: If the person abetted commits the act with a different intention or knowledge than that of the abettor, the abettor is punished as if the act was done with their intention.\n\nIllustration: A abets B to steal, but B does so with an intent to cause harm. A is punished as if he had intended harm.\n\nEffect: The abettor is punished as though the act was committed with their own intention or knowledge.",
  "BNS S. 51(111)": "Liability when a different act is done\n\nExplanation: When the act abetted is different from the one done, the abettor is liable for the act done if it was a probable consequence of the abetment and committed under the influence of the instigation, aid, or conspiracy.\n\nIllustration: A instigates a child to put poison into Z’s food, but the child mistakenly puts it into Y’s food. A is liable as if he had instigated the poisoning of Y.\n\nEffect: Abettor is held liable for the actual act done if it is a probable consequence of their abetment.",
  "BNS S. 52(112)": "Cumulative punishment for multiple offences\n\nExplanation: If the act abetted results in multiple offences, the abettor is liable to punishment for each offence.\n\nIllustration: A instigates B to resist distress by force. B causes grievous hurt during the resistance. A is liable for both offences.\n\nEffect: The abettor faces punishment for each distinct offence caused by the abetment.",
  "BNS S. 53(113)": "Liability for unintended effects\n\nExplanation: If the act abetted causes a different effect than intended by the abettor, but the abettor knew the effect was likely, he is liable for the unintended effect.\n\nIllustration: A instigates B to cause grievous hurt to Z. Z dies, and A is liable for murder if he knew death was likely.\n\nEffect: Abettor is liable for the unintended effect if they knew it was a probable consequence.",
  "BNS S. 54(114)": "Abettor’s presence when the offence is committed\n\nExplanation: If the abettor is present when the offence occurs, they are deemed to have committed the act or offence.\n\nIllustration: A, who would normally be liable as an abettor, is present when B commits the offence, and A is treated as having committed the offence.\n\nEffect: Presence of the abettor at the scene makes them liable for the offence committed.",
  "BNS S. 55(115)": "Abetment of a capital offence\n\nExplanation: If the abettor instigates an offence punishable by death or life imprisonment, but the offence is not committed, they can be punished with up to seven years of imprisonment and a fine. If hurt is caused due to the abetment, the punishment increases.\n\nIllustration: A instigates B to murder Z, but Z is not killed. A is liable to imprisonment up to seven years and a fine, and up to fourteen years if hurt is caused to Z.\n\nEffect: The abettor faces significant punishment if the intended serious crime is not committed or results in harm.",
  "BNS S. 56(116)": "Abetment of an offence punishable with imprisonment\n\nExplanation: If the abetted offence is not committed, and no specific punishment is prescribed for abetment, the abettor is liable to imprisonment up to one-fourth of the longest term for the offence or a fine, or both. If the abettor is a public servant whose duty is to prevent the offence, the punishment increases to up to half of the longest term.\n\nIllustration: A instigates B to give false evidence. A is liable even if B does not give false evidence.\n\nEffect: Abettors are punished based on the offence's potential punishment, with increased liability for public servants.",
  "BNS S. 57(117)": "Abetment of an offence by the public or more than ten persons\n\nExplanation: If the abettor incites the public or more than ten persons to commit an offence, they are liable to imprisonment up to seven years and a fine.\n\nIllustration: A affixes a placard inciting more than ten people to attack a sect. A is liable for the abetment of violence.\n\nEffect: Abettors who incite large groups face serious punishment, including imprisonment and fines.",
  "BNS S. 58(118)": "Concealing a design to commit an offence punishable with death or life imprisonment\n\nExplanation: If the abettor conceals a design to commit an offence punishable with death or life imprisonment, they are liable to imprisonment for up to seven years if the offence is committed, or up to three years and a fine if not.\n\nIllustration: A falsely informs the Magistrate about a dacoity, misdirecting efforts and facilitating the crime. A is punished under this section.\n\nEffect: Concealing a crime design that leads to an offence results in serious penalties.",
  "BNS S. 59(119)": "Public servant concealing a design to commit an offence they must prevent\n\nExplanation: If a public servant knowingly conceals the design of an offence they are duty-bound to prevent, they are liable to imprisonment, fine, or both. The penalty increases if the offence results in death or life imprisonment.\n\nIllustration: A police officer, knowing of a robbery plan, fails to report it. A is liable for the omission.\n\nEffect: Public servants who neglect their duties to prevent crimes face harsh punishments.",
  "BNS S. 60(120)": "Concealing a design to commit an offence punishable with imprisonment\n\nExplanation: If the abettor conceals the design of an offence punishable with imprisonment, they are liable to imprisonment for a term up to one-fourth of the longest sentence, or one-eighth if the offence is not committed, with a fine or both.\n\nIllustration: A knowingly conceals a design to commit theft. If the theft occurs, A is punished accordingly.\n\nEffect: Concealment of criminal intentions leads to significant legal consequences, even if the crime is not completed.",
  "BNS S. 61": "Agreement to commit an illegal act or use illegal means\n\nExplanation: Criminal conspiracy occurs when two or more people agree to commit a crime or use illegal methods to perform a non-illegal act.\n\nIllustration: Two people agree to steal but are caught before the theft happens; they are liable for the conspiracy.\n\nEffect: Punishment is similar to abetting the offence (if the offence is punishable with death, life imprisonment, or >2 years); otherwise, up to 6 months imprisonment, fine, or both.",
  "BNS S. 62": "Attempt to commit an offence punishable by imprisonment\n\nExplanation: A person tries to commit a crime but doesn't fully complete it. If any act is done towards committing the crime, they are liable.\n\nIllustration: A person attempts to steal jewels but finds none in the box; the attempt still qualifies as a crime.\n\nEffect: Imprisonment for up to half the term of the original offence, or fine, or both.",
  "BNS S. 63(375)": "Penetration or manipulation without consent\n\nExplanation: Defines rape as sexual penetration or manipulation of any body part or object without the woman's consent or in specific circumstances (e.g., under duress, intoxication).\n\nIllustration: A man forces a woman to engage in sexual acts against her will, or in specific conditions like mental incapacity.\n\nEffect: The act of rape is punishable under Section 376 with varying severity depending on circumstances.",
  "BNS S. 64(376)": "Rape committed by certain individuals (e.g., police officers, public servants)\n\nExplanation: Specifies that rape by individuals in positions of authority (e.g., police officers, public servants) is punished severely, especially if the victim is in custody.\n\nIllustration: A police officer rapes a woman in their custody; they are severely punished.\n\nEffect: Rigorous imprisonment for not less than 10 years, potentially life imprisonment, plus a fine.",
  "BNS S. 64(Subsection 1)": "Rape on a woman under 16\n\nExplanation: Punishment for raping a woman under 16 years is severe, with a minimum 20-year sentence or life imprisonment.\n\nIllustration: A person rapes a woman under 16 years.\n\nEffect: Imprisonment for not less than 20 years, up to life imprisonment, with fine for victim rehabilitation.",
  "BNS S. 65(Subsection 2)": "Rape on a woman under 12\n\nExplanation: Rape on a woman under 12 years is treated more severely, potentially resulting in the death penalty.\n\nIllustration: A person rapes a woman under 12 years.\n\nEffect: Imprisonment for life or death, plus a fine for the victim's medical expenses and rehabilitation.",
  "BNS S. 66(376A)": "Inflicting injury causing death or persistent vegetative state during the commission of rape\n\nExplanation: If a rape results in the woman's death or causes her to be in a persistent vegetative state, the offender is severely punished.\n\nIllustration: A man rapes a woman, and during the assault, she dies or is left in a persistent vegetative state.\n\nEffect: Rigorous imprisonment for not less than 20 years, up to life imprisonment, or death.",
  "BNS S. 67(376B)": "Sexual intercourse by a husband with his wife who is living separately without consent\n\nExplanation: A husband who has sexual intercourse with his wife during separation, without her consent, faces legal consequences.\n\nIllustration: A husband forcibly has sex with his wife who is living separately, without her consent.\n\nEffect: Imprisonment for 2-7 years and a fine.",
  "BNS S. 68(376C)": "Abuse of position of authority or fiduciary relationship to induce sexual intercourse\n\nExplanation: A person in authority, such as a public servant or hospital staff, induces sexual intercourse by exploiting their position of power.\n\nIllustration: A superintendent of a women’s institution induces a woman under his care to have sex with him.\n\nEffect: Rigorous imprisonment for 5-10 years and a fine.",
  "BNS S. 69": "Sexual intercourse by deceit or false promises\n\nExplanation: A person who deceives a woman into having sexual intercourse under false pretenses, such as promises of marriage, is punished.\n\nIllustration: A man promises to marry a woman but deceives her, leading to sexual intercourse.\n\nEffect: Imprisonment for up to 10 years and a fine.",
  "BNS S. 70(Subsection 1)": "Rape by multiple persons acting in common intention\n\nExplanation: When a woman is raped by multiple persons acting together, each person is equally liable for the crime.\n\nIllustration: A woman is raped by a group of men, and each of them is held responsible for the crime.\n\nEffect: Rigorous imprisonment for not less than 20 years, up to life imprisonment, and a fine.",
  "BNS S. 70(Subsection 2)": "Gang rape of a woman under 18 years\n\nExplanation: If a woman under 18 is gang-raped, the punishment is life imprisonment or death, with additional penalties.\n\nIllustration: A group of men rapes a girl under 18.\n\nEffect: Life imprisonment for the remainder of the person’s natural life, or death, and a fine.",
  "BNS S. 71": "Conviction under sections 64, 65, 66, or 67 followed by a subsequent conviction\n\nExplanation: A repeat offender convicted of crimes under sections 64, 65, 66, or 67 faces a severe punishment.\n\nIllustration: A man previously convicted of rape (under sections 64-67) is convicted again for a similar offence.\n\nEffect: Imprisonment for life (remainder of natural life) or death.",
  "BNS S. 72": "Publishing or printing the identity of the victim of specific crimes\n\nExplanation: It is illegal to disclose the identity of victims involved in certain offences without authorization.\n\nIllustration: A newspaper publishes the identity of a rape victim without permission.\n\nEffect: Imprisonment for up to 2 years and fine.",
  "BNS S. 73": "Publishing matters relating to court proceedings without permission\n\nExplanation: It is an offence to publish any matter related to court proceedings without prior court approval.\n\nIllustration: A journalist publishes details about an ongoing court case regarding sexual assault without court consent.\n\nEffect: Imprisonment for up to 2 years and fine.",
  "BNS S. 74": "Assaulting or using force on a woman intending to outrage her modesty\n\nExplanation: An individual using force to outrage a woman’s modesty is punished under this section.\n\nIllustration: A man grabs a woman’s arm and makes suggestive comments, intending to outraged her modesty.\n\nEffect: Imprisonment for 1-5 years and fine.",
  "BNS S. 75(Subsection 2)": "Physical contact, request for sexual favours, or showing pornography\n\nExplanation: A man committing certain acts like physical advances, sexual requests, or showing pornography is guilty of sexual harassment.\n\nIllustration: A man makes unwelcome sexual comments or shows inappropriate material to a woman.\n\nEffect: Rigorous imprisonment up to 3 years, or fine, or both.",
  "BNS S. 75(Subsection 3)": "Making sexually coloured remarks\n\nExplanation: A man making inappropriate sexual remarks is guilty of harassment.\n\nIllustration: A man makes lewd comments to a woman at work.\n\nEffect: Imprisonment for up to 1 year, or fine, or both.",
  "BNS S. 76": "Assault or criminal force with the intent to disrobe a woman\n\nExplanation: Any act of assault or force to disrobe a woman or compel her to be naked is punishable.\n\nIllustration: A man forcibly tries to remove a woman’s clothing.\n\nEffect: Imprisonment for 3-7 years and fine.",
  "BNS S. 77": "Watching or capturing a woman's private act and disseminating it\n\nExplanation: Watching, recording, or distributing private acts of a woman is punishable.\n\nIllustration: A man secretly films a woman in her private space and shares the footage.\n\nEffect: Imprisonment for 1-3 years and fine (first conviction); 3-7 years and fine (subsequent convictions).",
  "BNS S. 78": "Repeatedly following, contacting, or monitoring a woman\n\nExplanation: A man who repeatedly contacts or follows a woman against her will is guilty of stalking.\n\nIllustration: A man repeatedly sends messages to a woman who has asked him to stop.\n\nEffect: Imprisonment for up to 3 years and fine (first conviction); up to 5 years and fine (subsequent convictions).",
  "BNS S. 79": "Words, gestures, or acts intended to insult a woman's modesty\n\nExplanation: Any act or words intended to insult a woman’s modesty is punishable.\n\nIllustration: A man makes obscene gestures or comments to a woman in public.\n\nEffect: Simple imprisonment for up to 3 years and fine.",
  "BNS S. 80": "Death due to cruelty or harassment related to dowry demands\n\nExplanation: If a woman dies due to burns or injuries within 7 years of marriage, caused by dowry harassment, it’s considered dowry death.\n\nIllustration: A woman is burned to death after being harassed for dowry.\n\nEffect: Imprisonment for 7 years to life.",
  "BNS S. 81": "Deceit causing a woman to believe she is lawfully married and cohabit with a man\n\nExplanation: A man deceives a woman into believing they are married, causing her to live with him.\n\nIllustration: A man convinces a woman that they are married when they are not, and she lives with him.\n\nEffect: Imprisonment for up to 10 years and fine.",
  "BNS S. 82(82(1))": "Marrying while a spouse is alive and the marriage is void\n\nExplanation: A person remarries while their spouse is still alive and the marriage is void.\n\nIllustration: A person marries again while their first spouse is still alive.\n\nEffect: Imprisonment for up to 7 years and fine.",
  "BNS S. 82(82(2))": "Concealing the fact of a prior marriage while remarrying\n\nExplanation: A person marries again, hiding the fact that they have a prior spouse.\n\nIllustration: A person remarries while hiding their previous marriage from the new spouse.\n\nEffect: Imprisonment for up to 10 years and fine.",
  "BNS S. 83": "Fraudulent marriage ceremony without lawful intent\n\nExplanation: A person goes through a marriage ceremony knowing they aren't lawfully married.\n\nIllustration: A man knowingly goes through a wedding ceremony without intending to marry lawfully.\n\nEffect: Imprisonment for up to 7 years and fine.",
  "BNS S. 84": "Enticing or taking away a married woman with intent for illicit intercourse\n\nExplanation: A person takes a married woman with the intent for illicit relations.\n\nIllustration: A man takes a married woman with the intent of having an affair with her.\n\nEffect: Imprisonment for up to 2 years, fine, or both.",
  "BNS S. 85": "Cruelty by husband or his relatives toward the woman\n\nExplanation: A woman is subjected to cruelty by her husband or his relatives.\n\nIllustration: A husband subjects his wife to cruelty, or his relatives do.\n\nEffect: Imprisonment for up to 3 years and fine.",
  "BNS S. 86": "Definition of \"cruelty\"\n\nExplanation: Cruelty includes willful conduct likely to drive a woman to suicide or harm, or harassment to meet unlawful demands for property.\n\nIllustration: A woman is forced to face threats or physical abuse that may lead to suicide or grave harm.\n\nEffect: No punishment specified, serves as the definition for cruelty under S. 85.",
  "BNS S. 87": "Kidnapping or inducing a woman for forced marriage or illicit intercourse\n\nExplanation: A person kidnaps or induces a woman to marry against her will or be forced into illicit acts.\n\nIllustration: A woman is abducted to be married off against her will or forced into an illicit relationship.\n\nEffect: Imprisonment for up to 10 years and fine.",
  "BNS S. 88": "Causing miscarriage without the woman's consent\n\nExplanation: A person causes a miscarriage without the woman’s consent.\n\nIllustration: A man forces a woman to miscarry without her consent.\n\nEffect: Imprisonment for life or up to 10 years and fine.",
  "BNS S. 89": "Same as S. 88\n\nExplanation: Same as S. 88\n\nIllustration: Same as above.\n\nEffect: Imprisonment for life or up to 10 years and fine.",
  "BNS S. 90(90(1))": "Causing death with intent to induce miscarriage\n\nExplanation: A person causes the death of a woman with child by intentionally causing a miscarriage.\n\nIllustration: A person induces a miscarriage that leads to the woman’s death.\n\nEffect: Imprisonment for up to 10 years and fine.",
  "BNS S. 90(90(2))": "Causing death without the woman's consent\n\nExplanation: A person causes a woman's death by miscarriage without her consent.\n\nIllustration: A woman’s death is caused by miscarriage induced without her consent.\n\nEffect: Imprisonment for life or as per the punishment in 90(1).",
  "BNS S. 91": "Act done to prevent the birth of a child alive or cause its death post-birth\n\nExplanation: A person performs an act with the intent to prevent a child from being born alive or to cause it to die after birth.\n\nIllustration: A person performs an action that causes the death of a child either before or after birth, without a valid medical reason.\n\nEffect: Imprisonment for up to 10 years, or fine, or both.",
  "BNS S. 92": "Act causing death of quick unborn child\n\nExplanation: A person performs an act that would be considered culpable homicide and causes the death of an unborn child.\n\nIllustration: A person causes an injury to a pregnant woman that leads to the death of her unborn child, even if the woman survives.\n\nEffect: Imprisonment for up to 10 years and fine.",
  "BNS S. 93": "Exposing or abandoning a child under 12 years\n\nExplanation: A parent or caregiver leaves a child under 12 years with the intent to abandon them.\n\nIllustration: A parent leaves a child in a public place with no intention of returning.\n\nEffect: Imprisonment for up to 7 years, or fine, or both.",
  "BNS S. 94": "Concealing the birth of a child by disposing of the body\n\nExplanation: A person secretly disposes of the body of a child to conceal the birth.\n\nIllustration: A mother secretly buries or disposes of the body of her dead newborn child.\n\nEffect: Imprisonment for up to 2 years, or fine, or both.",
  "BNS S. 95": "Hiring or engaging a child to commit an offence\n\nExplanation: A person hires or employs a child to commit any criminal act.\n\nIllustration: A person engages a child for illegal activities like prostitution or theft.\n\nEffect: Imprisonment for 3 to 10 years, and fine; if the offence is committed, additional punishment as specified.",
  "BNS S. 96": "Inducing a child for illicit intercourse\n\nExplanation: A person induces a child under 18 to commit acts leading to illicit intercourse.\n\nIllustration: A person tricks or forces a child to go with someone for prostitution.\n\nEffect: Imprisonment for up to 10 years and fine.",
  "BNS S. 97": "Kidnapping a child under 10 to steal property\n\nExplanation: A person kidnaps a child under 10 to steal movable property from them.\n\nIllustration: A person abducts a child with the intent to steal their belongings.\n\nEffect: Imprisonment for up to 7 years and fine.",
  "BNS S. 98": "Selling or disposing of a child for prostitution\n\nExplanation: A person sells a child with the intent to use them for prostitution or illicit intercourse.\n\nIllustration: A person sells a child to a brothel or for sexual exploitation.\n\nEffect: Imprisonment for up to 10 years and fine.",
  "BNS S. 99": "Buying a child for prostitution\n\nExplanation: A person buys a child for the purpose of using them for prostitution or illicit acts.\n\nIllustration: A person purchases a child for the purpose of exploiting them in a brothel.\n\nEffect: Imprisonment for 7 to 14 years and fine.",
  "BNS S. 100": "Causing death with intention or knowledge\n\nExplanation: A person causes death with the intention or knowledge that the act will likely cause death.\n\nIllustration: A person sets a trap intending to kill someone, and the victim dies.\n\nEffect: Imprisonment for life or as per the severity of the offence.",
  "BNS S. 101(300)": "Culpable homicide with intent or knowledge of death\n\nExplanation: Actions with intent to kill or inflict injury likely to cause death, or an act that is imminently dangerous and likely to cause death.\n\nIllustration: A person shoots someone intending to kill them.\n\nEffect: The act leads to murder, but exceptions like provocation or self-defense may apply.",
  "BNS S. 102(301)": "Death of an unintended victim\n\nExplanation: If someone kills another person than the one they intended to kill, it is still culpable homicide.\n\nIllustration: A person aims to kill Person A but accidentally kills Person B.\n\nEffect: The person is charged with culpable homicide, as if they had killed the intended victim.",
  "BNS S. 103(302)": "Punishment for murder\n\nExplanation: The punishment for murder can be death, life imprisonment, or a fine.\n\nIllustration: A person found guilty of murder is sentenced to death.\n\nEffect: Murder conviction leads to death or life imprisonment, with classification as cognizable, non-bailable.",
  "BNS S. 104(303)": "Murder by a life convict\n\nExplanation: A life convict who commits murder may face death or life imprisonment for the remainder of their life.\n\nIllustration: A life convict kills a prison guard.\n\nEffect: The convict faces death or life imprisonment for committing murder while serving a life sentence.",
  "BNS S. 105(304)": "Punishment for lesser culpable homicide\n\nExplanation: Imprisonment for life or 5 to 10 years imprisonment, depending on intent.\n\nIllustration: A person causes death by rash driving but doesn't intend to kill.\n\nEffect: The offender may face a reduced sentence of life imprisonment or up to 10 years.",
  "BNS S. 106(304)": "Causing death by negligence\n\nExplanation: Death resulting from a negligent act may result in imprisonment and a fine.\n\nIllustration: A person kills someone in a car accident due to negligent driving.\n\nEffect: Punishment can range from up to five years of imprisonment and a fine.",
  "BNS S. 107(305)": "Abetment of suicide\n\nExplanation: Abetting the suicide of a minor or someone of unsound mind is punishable with death or imprisonment.\n\nIllustration: A person encourages a minor to commit suicide.\n\nEffect: The person who abets the suicide faces death, life imprisonment, or up to ten years imprisonment with a fine.",
  "BNS S. 108(306)": "Abetment of suicide\n\nExplanation: Any act that encourages or aids suicide, regardless of the person's condition.\n\nIllustration: A person persuades another to end their life.\n\nEffect: The abettor faces up to 10 years' imprisonment and a fine.",
  "BNS S. 109(307)": "Attempted murder\n\nExplanation: An attempt to commit murder can lead to imprisonment of up to 10 years or life imprisonment if injury occurs.\n\nIllustration: A person stabs another but does not kill them.\n\nEffect: The person faces up to 10 years of imprisonment or life imprisonment, depending on injury.",
  "BNS S. 110(308)": "Attempted culpable homicide\n\nExplanation: A person attempting culpable homicide without intent to murder may face up to 3 years' imprisonment or a fine.\n\nIllustration: A person strikes another intending to hurt but not kill.\n\nEffect: The punishment could be up to 3 years of imprisonment or a fine, with higher penalties if harm is caused.",
  "BNS S. 111": "Organised crime\n\nExplanation: Any unlawful activity committed by groups of individuals, such as kidnapping, robbery, vehicle theft, trafficking, and economic offences, with severe consequences.\n\nIllustration: A criminal syndicate running a human trafficking racket.\n\nEffect: The syndicate members face severe penalties, including life imprisonment or death, depending on the crime's severity.",
  "BNS S. 112": "Petty organised crime\n\nExplanation: Crimes like vehicle theft, trick theft, and pickpocketing committed by organised groups causing public insecurity.\n\nIllustration: A gang involved in ATM thefts or snatching.\n\nEffect: Punishment includes imprisonment for up to seven years and a fine.",
  "BNS S. 113": "Terrorist act\n\nExplanation: Acts intended to threaten India's unity, integrity, security, or disturb public order using hazardous substances like explosives.\n\nIllustration: A person planning a bombing to disrupt public order.\n\nEffect: The offender faces death or life imprisonment and significant fines.",
  "BNS S. 114": "Hurt\n\nExplanation: Causing bodily pain, disease, or infirmity to any person.\n\nIllustration: A person is injured in a fight, causing pain and discomfort.\n\nEffect: The offender may face penalties for inflicting hurt.",
  "BNS S. 115": "Voluntarily causing hurt\n\nExplanation: Causing hurt intentionally or knowingly to any person.\n\nIllustration: A person hits someone with the intent to cause injury.\n\nEffect: The person can be punished with up to one year of imprisonment or a fine up to ₹10,000.",
  "BNS S. 116": "Grievous hurt\n\nExplanation: Includes severe bodily harm such as emasculation, loss of sight, fractures, or life-threatening injuries.\n\nIllustration: A person suffers from permanent disability after a violent attack.\n\nEffect: The offender may face imprisonment and a fine.",
  "BNS S. 117": "Voluntarily causing grievous hurt\n\nExplanation: Causing grievous hurt intentionally or knowingly.\n\nIllustration: A person causes severe injury, like permanent disfigurement.\n\nEffect: The offender can face imprisonment for up to seven years.",
  "BNS S. 118": "Voluntarily causing hurt or grievous hurt by dangerous weapons\n\nExplanation: Causing harm using dangerous weapons like firearms, explosives, or animals.\n\nIllustration: A person uses a gun to threaten and injure another person.\n\nEffect: The punishment includes imprisonment for up to three years or a fine, and for grievous hurt, up to ten years of imprisonment.",
  "BNS S. 119": "Voluntarily causing hurt or grievous hurt to extort property or force illegal acts\n\nExplanation: Causing harm to extort property or compel someone to do something illegal.\n\nIllustration: A person is beaten to hand over money or perform illegal acts.\n\nEffect: The offender faces imprisonment for up to ten years and a fine.",
  "BNS S. 120": "Voluntarily causing hurt or grievous hurt to extort confession or compel restoration of property\n\nExplanation: Causing harm to extort confessions or force the return of stolen property.\n\nIllustration: A person is tortured to confess to a crime or return stolen items.\n\nEffect: The punishment is up to seven years of imprisonment and a fine, with more severe penalties for grievous hurt.",
  "BNS S. 121": "Voluntarily causing hurt or grievous hurt to deter public servant from his duty\n\nExplanation: Causes hurt or grievous hurt to a public servant in the discharge of his duty, or to deter any public servant from discharging their duty\n\nIllustration: A person causing hurt to a police officer while they are arresting someone\n\nEffect: Hurt: Imprisonment up to 5 years, fine, or both; Grievous Hurt: Imprisonment 1-10 years, fine",
  "BNS S. 122": "Voluntarily causing hurt or grievous hurt on provocation\n\nExplanation: Causing hurt or grievous hurt in response to grave and sudden provocation, without intending to hurt anyone other than the provoker\n\nIllustration: A person strikes another in response to a sudden insult\n\nEffect: Hurt: Imprisonment up to 1 month, fine up to ₹5000, or both; Grievous Hurt: Imprisonment up to 5 years, fine up to ₹10,000, or both",
  "BNS S. 123": "Causing hurt by means of poison, etc., with intent to commit an offence\n\nExplanation: Administering poison or any harmful substance with the intent to hurt or commit an offence\n\nIllustration: A person poisons someone to steal from them\n\nEffect: Imprisonment up to 10 years, fine",
  "BNS S. 124": "Voluntarily causing grievous hurt by use of acid\n\nExplanation: Causing permanent damage, deformity, burns, or grievous hurt using acid\n\nIllustration: A person throws acid at another, causing serious disfigurement\n\nEffect: Imprisonment 10 years to life, fine to cover medical expenses; Attempted acid use: 5-7 years imprisonment, fine",
  "BNS S. 125": "Act endangering life or personal safety of others\n\nExplanation: Recklessly or negligently endangering life or safety of others\n\nIllustration: A person drives dangerously, risking harm to pedestrians\n\nEffect: Imprisonment up to 3 months, fine up to ₹2500, or both; Hurt: Imprisonment up to 6 months, fine up to ₹5000, or both; Grievous Hurt: Imprisonment up to 3 years, fine up to ₹10,000, or both",
  "BNS S. 126": "Wrongful restraint\n\nExplanation: Obstructing a person from proceeding in a direction where they have a right to go\n\nIllustration: A person blocks a pedestrian path, preventing someone from passing\n\nEffect: Simple imprisonment up to 1 month, fine up to ₹5000, or both",
  "BNS S. 127": "Wrongful confinement\n\nExplanation: Preventing a person from proceeding beyond certain limits\n\nIllustration: A person locks another in a room, preventing them from leaving\n\nEffect: Imprisonment up to 1 year, fine up to ₹5000, or both; Confinement for 3 days or more: Imprisonment up to 3 years, fine up to ₹10,000, or both; Confinement for 10 days or more: Imprisonment up to 5 years, fine not less than ₹10,000",
  "BNS S. 128": "Force\n\nExplanation: Causing motion, change of motion, or cessation of motion to a person or substance\n\nIllustration: A person pushes another, causing them to move\n\nEffect: Causes motion, change of motion, or cessation of motion through bodily power, substances, or animals",
  "BNS S. 129": "Criminal force\n\nExplanation: Intentionally using force on someone without their consent to commit an offence or cause injury, fear, or annoyance\n\nIllustration: A person pushes another in a fight, intending to cause harm\n\nEffect: Imprisonment or fine, or both, for intentional use of force causing injury, fear, or annoyance without consent",
  "BNS S. 130": "Assault\n\nExplanation: Making gestures or preparations intending to cause apprehension of criminal force\n\nIllustration: A person shakes their fist at another, causing fear of a punch\n\nEffect: Imprisonment or fine for gestures or preparations intending to cause fear of criminal force",
  "BNS S. 131": "Assault or criminal force to a person, without grave provocation\n\nExplanation: If someone assaults or uses criminal force to another person, other than in response to grave provocation, they face punishment.\n\nIllustration: A person hits another during an argument not provoked by the other party\n\nEffect: Imprisonment for up to 3 months, fine of up to ₹1,000, or both.",
  "BNS S. 132": "Assaulting or using criminal force to a public servant in the execution of their duty\n\nExplanation: A person uses force against a police officer trying to prevent them from fulfilling their duties\n\nIllustration: A person pushes a police officer while they are arresting someone\n\nEffect: Imprisonment for up to 2 years, fine, or both.",
  "BNS S. 133": "Assaulting or using criminal force intending to dishonor a person, without grave provocation\n\nExplanation: A person assaults another intending to embarrass or dishonor them\n\nIllustration: Someone slaps another to humiliate them\n\nEffect: Imprisonment up to 2 years, fine, or both.",
  "BNS S. 134": "Assaulting or using force while attempting theft on someone's property\n\nExplanation: A person uses force to snatch a purse from someone\n\nIllustration: A thief attempts to grab a handbag from a person in the street\n\nEffect: Imprisonment up to 2 years, fine, or both.",
  "BNS S. 135": "Assault or criminal force to attempt wrongful confinement\n\nExplanation: A person uses force to stop someone from leaving a place\n\nIllustration: A person locks someone in a room to prevent them from exiting\n\nEffect: Imprisonment up to 1 year, fine up to ₹5,000, or both.",
  "BNS S. 136": "Assaulting or using criminal force on grave provocation\n\nExplanation: A person assaults another in response to sudden grave provocation\n\nIllustration: A person slaps someone after being insulted\n\nEffect: Simple imprisonment up to 1 month, fine up to ₹1,000, or both.",
  "BNS S. 137": "Kidnapping a person from India or from lawful guardianship\n\nExplanation: Kidnapping a person or child without consent, either from India or from their lawful guardian\n\nIllustration: A person takes a child from their guardian’s custody without permission\n\nEffect: Imprisonment up to 7 years, and fine.",
  "BNS S. 138": "Abduction by force or deceit\n\nExplanation: A person forces or deceives another to go from one place to another\n\nIllustration: A person tricks someone into traveling to a different city\n\nEffect: Varies based on the case.",
  "BNS S. 139": "Kidnapping or maiming a child to use them for begging\n\nExplanation: A person kidnaps or harms a child to make them beg\n\nIllustration: A person kidnaps a child to use them in the streets for alms\n\nEffect: Imprisonment not less than 10 years, or life imprisonment, with fine.",
  "BNS S. 140": "Kidnapping or abduction with intent to murder or demand ransom\n\nExplanation: A person abducts another to threaten their life or demand ransom\n\nIllustration: A person kidnaps someone to extort money from their family\n\nEffect: Death penalty or life imprisonment, up to 10 years, with fine.",
  "BNS S. 141": "Importing minors with intent of illicit activity\n\nExplanation: Punishable with up to 10 years imprisonment and fine for importing minors for forced or seduced illicit intercourse.\n\nIllustration: Importing a girl under 21 or boy under 18 for illicit purposes.\n\nEffect: Imprisonment up to 10 years and fine.",
  "BNS S. 142": "Concealing or detaining a kidnapped person\n\nExplanation: Punished similarly as the original act of kidnapping or abduction.\n\nIllustration: Concealing a person who has been abducted.\n\nEffect: Same punishment as for kidnapping or abduction.",
  "BNS S. 143": "Recruitment or transportation for exploitation\n\nExplanation: Involves force, threats, coercion, fraud, or deception for exploitation, including sexual slavery or forced labor.\n\nIllustration: Trafficking a person using force or fraud for exploitation.\n\nEffect: Imprisonment from 7 years to life, and fine.",
  "BNS S. 144": "Engaging a trafficked person for sexual exploitation\n\nExplanation: Imprisonment and fine for engaging trafficked persons (especially minors) for sexual exploitation.\n\nIllustration: Engaging a trafficked minor for sexual exploitation.\n\nEffect: Imprisonment from 3 to 10 years (for adults) and fines.",
  "BNS S. 145": "Import, export, buy, sell, or deal in slaves\n\nExplanation: Punishable with life imprisonment or up to 10 years imprisonment and fine for habitual dealing in slaves.\n\nIllustration: Habitual involvement in trafficking or selling slaves.\n\nEffect: Life imprisonment or imprisonment up to 10 years and fine.",
  "BNS S. 146": "Compelling labor against the person’s will\n\nExplanation: Punishable with imprisonment up to 1 year or fine for forcing labor.\n\nIllustration: Forcing someone to work against their will.\n\nEffect: Imprisonment up to 1 year or fine, or both.",
  "BNS S. 147": "Waging or attempting war against India\n\nExplanation: Waging war or attempting it against the government, or abetting such acts, is punishable with death or life imprisonment.\n\nIllustration: Joining a rebellion against the government.\n\nEffect: Death or life imprisonment and fine.",
  "BNS S. 148": "Conspiring to wage war or force government actions\n\nExplanation: Punishable with life imprisonment or up to 10 years for conspiring against the government.\n\nIllustration: Conspiring to overawe the government with criminal force.\n\nEffect: Life imprisonment or up to 10 years imprisonment and fine.",
  "BNS S. 149": "Preparing for war against India\n\nExplanation: Preparing to wage war by collecting arms, men, or ammunition is punishable with life imprisonment or up to 10 years imprisonment.\n\nIllustration: Collecting arms to prepare for war against India.\n\nEffect: Life imprisonment or imprisonment up to 10 years and fine.",
  "BNS S. 150": "Concealing war preparations\n\nExplanation: Concealing acts or omissions to facilitate war preparations is punishable with imprisonment up to 10 years and fine.\n\nIllustration: Concealing war preparations to help waging war.\n\nEffect: Imprisonment up to 10 years and fine.",
  "BNS S. 151": "Assaulting or restraining President or Governor to influence their lawful powers\n\nExplanation: Assault or restrain with criminal force or show of force to compel or prevent lawful action\n\nIllustration: Assaulting a Governor to prevent action on a law\n\nEffect: Imprisonment up to 7 years and fine",
  "BNS S. 152": "Acts that excite secession, rebellion, or subversive activities\n\nExplanation: Inducing or encouraging acts endangering India's sovereignty and integrity, via speech, media, or financial means\n\nIllustration: Promoting separatist movements or rebellion\n\nEffect: Imprisonment for life or up to 7 years, and fine",
  "BNS S. 153": "Waging war against a peaceful foreign state\n\nExplanation: Engaging in or attempting to engage in war against a foreign state at peace with India\n\nIllustration: Waging war against a peaceful neighboring state\n\nEffect: Imprisonment for life or up to 7 years, and fine",
  "BNS S. 154": "Attacking foreign state territories at peace with India\n\nExplanation: Making preparations or committing depredation (attack) on foreign peaceful state territories\n\nIllustration: Attacking a peaceful foreign nation’s territory\n\nEffect: Imprisonment up to 7 years, fine, and property forfeiture",
  "BNS S. 155": "Receiving stolen property from war or depredation\n\nExplanation: Receiving property taken in war or depredation without lawful authority\n\nIllustration: Receiving property taken during war or conflict\n\nEffect: Imprisonment up to 7 years, fine, and property forfeiture",
  "BNS S. 156": "Public servant letting a state or war prisoner escape\n\nExplanation: A public servant allowing a state or war prisoner to escape\n\nIllustration: Allowing a prisoner of war to escape custody\n\nEffect: Life imprisonment or up to 10 years, and fine",
  "BNS S. 157": "Negligence by public servant causing prisoner escape\n\nExplanation: A public servant negligently allowing a prisoner to escape\n\nIllustration: Negligently allowing a prisoner of war to escape\n\nEffect: Simple imprisonment up to 3 years and fine",
  "BNS S. 158": "Aiding a prisoner’s escape or resisting recapture\n\nExplanation: Helping, rescuing, or harboring an escaped prisoner or resisting recapture\n\nIllustration: Helping a prisoner of war escape custody\n\nEffect: Life imprisonment or up to 10 years, and fine",
  "BNS S. 159": "Abetting mutiny or seducing military personnel from duty\n\nExplanation: Encouraging mutiny or seducing military personnel from their allegiance\n\nIllustration: Encouraging a soldier to rebel against orders\n\nEffect: Life imprisonment or up to 10 years, and fine",
  "BNS S. 160": "Abetting mutiny that leads to actual mutiny\n\nExplanation: If mutiny occurs due to abetment, the person is punished\n\nIllustration: Encouraging mutiny that leads to rebellion in the military\n\nEffect: Death or life imprisonment, or up to 10 years, and fine",
  "BNS S. 161": "Abetting assault on a superior officer by military personnel\n\nExplanation: Abetting the assault on a superior officer while executing official duties\n\nIllustration: Encouraging a soldier to assault his commanding officer\n\nEffect: Imprisonment up to 3 years and fine",
  "BNS S. 162": "Abetting assault that leads to actual assault on superior officer\n\nExplanation: Abetting assault that results in the commission of the assault\n\nIllustration: Encouraging assault on a superior officer that occurs due to abetment\n\nEffect: Imprisonment up to 7 years and fine",
  "BNS S. 163": "Encouraging desertion by military personnel\n\nExplanation: Abetting a soldier, sailor, or airman in deserting their post\n\nIllustration: Persuading a soldier to desert the military\n\nEffect: Imprisonment up to 2 years, or fine, or both",
  "BNS S. 164": "Harbouring or concealing a deserter from the military\n\nExplanation: Harbouring a soldier, sailor, or airman who has deserted\n\nIllustration: Hiding a soldier who has deserted the army\n\nEffect: Imprisonment up to 2 years, or fine, or both",
  "BNS S. 165": "Concealing a deserter aboard a merchant vessel\n\nExplanation: The master or person in charge of a vessel negligently concealing a deserter\n\nIllustration: Ignoring a soldier hidden aboard a merchant vessel\n\nEffect: Fine of 3,000 rupees",
  "BNS S. 166": "Abetting insubordination among military personnel\n\nExplanation: Encouraging or supporting acts of insubordination by military personnel\n\nIllustration: Encouraging a soldier to act insubordinately\n\nEffect: Imprisonment up to 2 years, or fine, or both",
  "BNS S. 167": "Military personnel not subject to punishment under this Sanhita\n\nExplanation: Military personnel are not liable for certain offenses under this chapter\n\nIllustration: A soldier, sailor, or airman subject to military law\n\nEffect: No punishment under this Sanhita",
  "BNS S. 168": "Impersonating military personnel\n\nExplanation: Wearing military garb or carrying tokens resembling those of military personnel\n\nIllustration: A civilian wearing military uniform to impersonate a soldier\n\nEffect: Imprisonment up to 3 months, or fine of 2,000 rupees, or both",
  "BNS S. 169": "Defining \"candidate\" and \"electoral right\"\n\nExplanation: Explaining the meaning of \"candidate\" and \"electoral right\" for election law purposes\n\nIllustration: A person nominated as a candidate or exercising their right to vote\n\nEffect: No direct punishment, provides legal definitions",
  "BNS S. 170": "Offering or accepting bribes related to electoral rights\n\nExplanation: Offering or receiving gratification to influence voting behavior\n\nIllustration: Offering money to a voter to influence their vote\n\nEffect: Imprisonment and penalty as per specific case circumstances",
  "BNS S. 171": "Interference with free electoral rights\n\nExplanation: Voluntary interference with the free exercise of any electoral right\n\nIllustration: Threatening a candidate or voter to influence their decision\n\nEffect: Punished with imprisonment up to 1 year, fine, or both",
  "BNS S. 172": "Impersonating another voter\n\nExplanation: Voting in someone else's name or impersonating a deceased or fictitious person\n\nIllustration: Voting as someone else at an election\n\nEffect: Punished with imprisonment up to 1 year, fine, or both",
  "BNS S. 173": "Bribery during elections\n\nExplanation: Offering or accepting bribery to influence votes\n\nIllustration: Offering money or gifts to voters\n\nEffect: Imprisonment up to 1 year, or fine, or both",
  "BNS S. 174": "Undue influence or impersonation at elections\n\nExplanation: Engaging in undue influence or impersonation during voting\n\nIllustration: Threatening voters or impersonating others\n\nEffect: Imprisonment up to 1 year, fine, or both",
  "BNS S. 175": "Making false statements about candidates\n\nExplanation: Spreading false statements about a candidate’s personal conduct or character\n\nIllustration: Falsely accusing a candidate of criminal behavior\n\nEffect: Fine",
  "BNS S. 176": "Unauthorized election expenses\n\nExplanation: Incurring or authorizing expenses without the candidate’s written authority\n\nIllustration: Spending money on a public meeting for a candidate without approval\n\nEffect: Fine up to 10,000 rupees",
  "BNS S. 177": "Failure to keep accounts for election expenses\n\nExplanation: Not maintaining accounts for election-related expenses as required by law\n\nIllustration: Failing to keep a proper record of election-related expenditures\n\nEffect: Fine up to 5,000 rupees",
  "BNS S. 178": "Counterfeiting currency or government-issued stamps\n\nExplanation: Counterfeiting coins, government stamps, or currency notes\n\nIllustration: Forging a banknote or government stamp\n\nEffect: Imprisonment for life or up to 10 years and fine",
  "BNS S. 179": "Using forged or counterfeit currency or government stamps\n\nExplanation: Using or selling counterfeit or forged currency notes or coins\n\nIllustration: Using a fake coin or banknote in a transaction\n\nEffect: Imprisonment for life or up to 10 years and fine",
  "BNS S. 180": "Possession of counterfeit currency or stamps\n\nExplanation: Possessing counterfeit coins, notes, or stamps with the intent to use them as genuine\n\nIllustration: Keeping a counterfeit banknote with the intent to use it\n\nEffect: Imprisonment up to 7 years, fine, or both",
  "BNS S. 182(-1)": "Making, using, or delivering documents resembling currency notes.\n\nExplanation: Whoever creates, uses, or delivers any document resembling or calculated to deceive as a currency-note or bank-note commits an offense.\n\nIllustration: Example: A person creates a flyer designed to look like a currency note for promotional purposes, misleading others.\n\nEffect: Punishment: Fine up to ₹300.",
  "BNS S. 182(-2)": "Failure to disclose the maker's details for such documents.\n\nExplanation: If a person refuses to disclose, without lawful excuse, the name and address of the person who printed or made the deceptive document, they commit an offense.\n\nIllustration: Example: A shopkeeper refuses to reveal the source of counterfeit-like promotional materials found in their possession.\n\nEffect: Punishment: Fine up to ₹600.",
  "BNS S. 182(-3)": "Name appearing on documents connected with offenses under sub-section (1).\n\nExplanation: If a name is found on any document connected with the offense under sub-section (1), the associated person can be charged.\n\nIllustration: Example: A person's name appears on a batch of counterfeit promotional documents resembling banknotes, implicating them in the offense.\n\nEffect: Can lead to prosecution under sub-section (1), with the applicable fine of up to ₹300 or additional legal scrutiny.",
  "BNS S. 183": "Effacing or removing Government-issued stamps with intent to cause loss.\n\nExplanation: Whoever fraudulently removes or effaces writing from a stamped substance, or removes a used stamp to reuse it for a different purpose, commits an offense.\n\nIllustration: Example: A person removes a revenue stamp from a document and attempts to reuse it on another document to avoid paying the Government revenue.\n\nEffect: Punishment: Imprisonment of up to 3 years, fine, or both. Classification: Cognizable, bailable, triable by a Magistrate of the first class.",
  "BNS S. 184": "Using previously used Government revenue stamps.\n\nExplanation: Whoever fraudulently reuses a Government-issued stamp for revenue purposes, knowing it has already been used, commits an offense.\n\nIllustration: Example: A person removes a used stamp from an old document and reuses it on a new document to avoid paying for a new stamp.\n\nEffect: Punishment: Imprisonment of up to 2 years, fine, or both. Classification: Cognizable, bailable, triable by any Magistrate.",
  "BNS S. 185": "Erasing or removing marks indicating a Government stamp has been used.\n\nExplanation: Whoever fraudulently erases or removes marks from a Government-issued revenue stamp, or knowingly possesses, sells, or disposes of such a stamp, commits an offense.\n\nIllustration: Example: A person removes the cancellation mark from a revenue stamp and attempts to reuse or sell it for profit, causing loss to the Government.\n\nEffect: Punishment: Imprisonment of up to 3 years, fine, or both. Classification: Cognizable, bailable, triable by a Magistrate of the first class.",
  "BNS S. 186": "Prohibition of fictitious stamps.\n\nExplanation: Whoever makes, uses, deals in, sells, or possesses fictitious stamps, or possesses tools or materials for making such stamps, commits an offense. A fictitious stamp is one falsely purporting to be issued by the Government for postage purposes.\n\nIllustration: Example: A person creates fake postage stamps resembling official Government-issued stamps and attempts to sell or use them for postal purposes.\n\nEffect: Punishment: Fine up to ₹200. Any fictitious stamps, tools, or materials used to create them may be seized and forfeited. Classification: Cognizable, bailable, triable by any Magistrate.",
  "BNS S. 187": "Person employed in a mint causing coin to deviate from the lawfully fixed weight or composition.\n\nExplanation: The section punishes any person employed in a mint who intentionally causes a coin to be of different weight or composition than fixed by law, either by action or omission.\n\nIllustration: A mint employee intentionally alters the weight of a coin, which could lead to the production of counterfeit currency.\n\nEffect: Punishment of imprisonment for up to 7 years and fine. The offense is cognizable, non-bailable, and triable by Magistrate of the first class.",
  "BNS S. 188": "Unlawfully taking coining tools or instruments from the mint.\n\nExplanation: The section punishes anyone who, without lawful authority, takes coining tools or instruments from a mint lawfully established in India.\n\nIllustration: A person unlawfully removes coining tools from a mint with the intent to misuse them for illegal purposes.\n\nEffect: Punishment of imprisonment for up to 7 years and fine. The offense is cognizable, non-bailable, and triable by Magistrate of the first class.",
  "BNS S. 189(-1)": "Definition of \"Unlawful Assembly\"\n\nExplanation: An assembly of five or more persons becomes unlawful if the common objective is to intimidate, resist the execution of laws, commit crimes, or enforce rights through force or threats.\n\nIllustration: An assembly of five persons blocking a road with the intent to enforce their claim to the road by force.\n\nEffect: The assembly is unlawful if it fits any of the descriptions provided, and those involved are subject to punishment.",
  "BNS S. 189(-2)": "Joining or continuing in an unlawful assembly\n\nExplanation: A person knowingly joins or continues in an unlawful assembly, becoming a member, subject to punishment.\n\nIllustration: A person, aware that an assembly is unlawful, joins the group to resist police intervention.\n\nEffect: Imprisonment up to 6 months, fine, or both.",
  "BNS S. 189(-3)": "Joining or continuing after dispersal order\n\nExplanation: A person knowingly joins or continues in an unlawful assembly after being commanded to disperse.\n\nIllustration: A protest group is ordered to disperse, but individuals knowingly remain in the assembly.\n\nEffect: Imprisonment up to 2 years, fine, or both.",
  "BNS S. 189(-4)": "Armed participation in unlawful assembly\n\nExplanation: A person armed with a deadly weapon or anything likely to cause death joins or continues in an unlawful assembly.\n\nIllustration: A person armed with a knife continues participating in a violent protest after being ordered to disperse.\n\nEffect: Imprisonment up to 2 years, fine, or both.",
  "BNS S. 189(-5)": "Joining or continuing an assembly causing public disturbance\n\nExplanation: A person knowingly joins an assembly that is likely to disturb the public peace and does not disperse after being commanded.\n\nIllustration: A crowd gathers to protest and is warned by authorities to disperse but remains present.\n\nEffect: Imprisonment up to 6 months, fine, or both.",
  "BNS S. 189(-6)": "Engaging, hiring, or promoting others to join unlawful assembly\n\nExplanation: A person who hires or engages others to join an unlawful assembly is punishable as a member.\n\nIllustration: A leader hires individuals to participate in a violent assembly to disrupt public order.\n\nEffect: Punishment equivalent to membership and participation in the unlawful assembly.",
  "BNS S. 189(-7)": "Harbouring persons for unlawful assembly\n\nExplanation: A person who harbours or assembles individuals aware they are hired for an unlawful assembly is punishable.\n\nIllustration: A house owner allows hired individuals to stay in their home before participating in an unlawful assembly.\n\nEffect: Imprisonment up to 6 months, fine, or both.",
  "BNS S. 189(-8)": "Assisting in unlawful assembly\n\nExplanation: A person engaged in assisting with acts of an unlawful assembly is subject to the same penalties as the assembly itself.\n\nIllustration: A person is hired to help block roads during a protest.\n\nEffect: Imprisonment up to 6 months, fine, or both.",
  "BNS S. 189(-9)": "Armed assistance in unlawful assembly\n\nExplanation: A person hired to assist in an unlawful assembly while armed is punishable with greater severity.\n\nIllustration: A hired person arrives at a protest armed with a weapon to enforce the group’s demands.\n\nEffect: Imprisonment up to 2 years, fine, or both.",
  "BNS S. 190": "Liability of all members of unlawful assembly for offence committed in pursuit of common object\n\nExplanation: If any offence is committed by a member of an unlawful assembly while pursuing the common object of that assembly, or if the offence was likely to happen due to the common objective, all members of the assembly are guilty of that offence.\n\nIllustration: A group of protesters commits violence during a demonstration, and all members are considered guilty, even if some did not directly engage in the act.\n\nEffect: All members are liable for the same offence, regardless of individual involvement, with consequences based on the offence type.",
  "BNS S. 191": "Liability of all members of unlawful assembly for rioting\n\nExplanation: If an unlawful assembly or any of its members uses force or violence in pursuit of the assembly's common objective, all members are guilty of the offence of rioting.\n\nIllustration: A group of individuals involved in a protest resort to violence. All participants are guilty of rioting, whether or not they directly used violence.\n\nEffect: Rioting punishable by imprisonment (up to 2 years, or 5 years if armed with deadly weapon), or fine, or both.",
  "BNS S. 192": "Maliciously giving provocation with intent to cause riot\n\nExplanation: If a person gives illegal provocation knowing it may cause a riot, they are liable. If a riot happens, punishment extends to a year; if not, up to 6 months or fine.\n\nIllustration: A person shouts provocative statements during a tense situation, knowing it will likely lead to a riot.\n\nEffect: If riot occurs: Imprisonment up to 1 year, or fine, or both. If no riot: Imprisonment up to 6 months, or fine, or both.",
  "BNS S. 193": "Riot for the benefit of the landowner/occupier\n\nExplanation: If the riot is for the benefit of the landowner or their agent/manager, and they don't take lawful actions to prevent or suppress it, they will be liable to fine.\n\nIllustration: Fine for failure to prevent or suppress the riot when they have reason to believe it will happen.\n\nEffect: nan",
  "BNS S. 194": "Affray (fighting in a public place)\n\nExplanation: When two or more persons fight in a public place and disturb the public peace, they are committing an affray.\n\nIllustration: Punishable with imprisonment up to 1 month, or a fine up to 1,000 rupees, or both.\n\nEffect: nan",
  "BNS S. 195(-1)": "Assaulting or obstructing a public servant during riot control\n\nExplanation: If someone assaults, obstructs, or uses criminal force against a public servant while they are attempting to disperse an unlawful assembly, suppress a riot, or quell an affray.\n\nIllustration: A person A hits a police officer while trying to disperse a riot.\n\nEffect: Punishable with imprisonment up to 3 years, a fine of at least ₹25,000, or both.",
  "BNS S. 195(-2)": "Threatening or attempting to obstruct a public servant\n\nExplanation: If someone threatens, attempts to assault, or obstructs a public servant in the course of their duties in attempting to disperse an unlawful assembly, suppress a riot, or quell an affray.\n\nIllustration: Person B threatens to harm a police officer while they attempt to control a riot.\n\nEffect: Punishable with imprisonment up to 1 year, or a fine, or both.",
  "BNS S. 196(-1)": "Promoting enmity between groups on grounds of religion, race, etc.\n\nExplanation: If someone promotes or attempts to promote disharmony or feelings of enmity, hatred, or ill-will between groups on grounds of religion, race, language, caste, or community, or commits acts prejudicial to maintaining harmony between groups.\n\nIllustration: A person writes an article inciting violence between two communities.\n\nEffect: Punishable with imprisonment up to 3 years, a fine, or both.",
  "BNS S. 196(-2)": "Acts committed in places of worship or during religious ceremonies\n\nExplanation: If the offence specified in subsection (1) is committed in a place of worship or during religious ceremonies.\n\nIllustration: A person delivers a speech inciting violence in a mosque during prayer.\n\nEffect: Punishable with imprisonment up to 5 years and liable to fine.",
  "BNS S. 197((1)(a))": "Imputation against a class of persons' allegiance to the Constitution and sovereignty of India\n\nExplanation: If someone makes or publishes an imputation that any class of persons cannot bear true faith and allegiance to the Constitution of India or uphold the sovereignty and integrity of India.\n\nIllustration: A person writes that a certain community cannot be loyal to the Constitution.\n\nEffect: Punishable with imprisonment up to 3 years, a fine, or both.",
  "BNS S. 197((1)(b))": "Denial or deprivation of citizenship rights based on group affiliation\n\nExplanation: If someone asserts or propagates that any class of persons should be deprived of their rights as citizens of India due to their religious, racial, language, or community affiliation.\n\nIllustration: A leader advises that a particular caste should be denied voting rights.\n\nEffect: Punishable with imprisonment up to 3 years, a fine, or both.",
  "BNS S. 197((1)(c))": "Assertion causing disharmony or enmity between groups\n\nExplanation: If someone publishes an assertion or appeal about a class of persons that causes or is likely to cause disharmony, enmity, or ill-will between them and others.\n\nIllustration: A speech that creates hate between two groups based on caste or religion.\n\nEffect: Punishable with imprisonment up to 3 years, a fine, or both.",
  "BNS S. 197((1)(d))": "False or misleading information endangering sovereignty or security of India\n\nExplanation: If someone publishes false or misleading information that jeopardizes the sovereignty, unity, integrity, or security of India.\n\nIllustration: Publishing false reports that threaten national security.\n\nEffect: Punishable with imprisonment up to 3 years, a fine, or both.",
  "BNS S. 197(-2)": "Offence committed in places of worship or during religious ceremonies\n\nExplanation: If any offence specified in subsection (1) is committed in a place of worship or during religious ceremonies.\n\nIllustration: A person spreading hatred in a mosque or temple during a ceremony.\n\nEffect: Punishable with imprisonment up to 5 years and liable to fine.",
  "BNS S. 198": "Public servant disobeying law with intent to cause injury to any person\n\nExplanation: If a public servant knowingly disobeys any legal direction regarding how they are to conduct themselves, intending or knowing that such disobedience will likely cause injury to any person.\n\nIllustration: A, an officer, disobeys a lawfully required action to seize property to satisfy a court decree, knowing it will harm Z.\n\nEffect: Punishable with simple imprisonment for up to 1 year, fine, or both.",
  "BNS S. 199": "Public servant disobeying direction under law\n\nExplanation: A public servant knowingly disobeys legal directions, such as requiring attendance for investigation or failing to record information about cognizable offences as required by law.\n\nIllustration: -\n\nEffect: Rigorous imprisonment for 6 months to 2 years, and fine.",
  "BNS S. 200": "Punishment for non-treatment of victim\n\nExplanation: Whoever, in charge of a hospital, contravenes the provisions of section 449 of the Bharatiya Nagarik Suraksha Sanhita, 2023, shall be punished with imprisonment or fine.\n\nIllustration: -\n\nEffect: Imprisonment for 1 year, or fine, or both.",
  "BNS S. 201": "Public servant framing an incorrect document with intent to cause injury\n\nExplanation: Whoever, being a public servant, knowingly prepares or translates a document or electronic record incorrectly, intending to cause injury to any person, shall be punished.\n\nIllustration: -\n\nEffect: Imprisonment for 3 years, or fine, or both.",
  "BNS S. 202": "Public servant unlawfully engaging in trade\n\nExplanation: Whoever, being a public servant, is legally bound not to engage in trade and engages in trade, shall be punished.\n\nIllustration: -\n\nEffect: Simple imprisonment for 1 year, or fine, or both, or community service.",
  "BNS S. 203": "Public servant unlawfully buying or bidding for property\n\nExplanation: A public servant, legally bound not to buy or bid for certain property, does so in his own name or through others, shall be punished.\n\nIllustration: -\n\nEffect: Simple imprisonment for 2 years, or fine, or both, and confiscation of property, if purchased.",
  "BNS S. 204": "Personating a public servant\n\nExplanation: A person pretending to hold a public office or falsely personating another person holding such an office and acting under its guise shall be punished.\n\nIllustration: -\n\nEffect: Imprisonment for not less than 6 months but which may extend to 3 years and fine.",
  "BNS S. 205": "Wearing garb or carrying token used by public servant with fraudulent intent\n\nExplanation: A person not belonging to a certain class of public servants who wears any garb or carries a token resembling that used by public servants to deceive others about their position.\n\nIllustration: -\n\nEffect: Imprisonment for 3 months, or fine of 5,000 rupees, or both.",
  "BNS S. 206": "Absconding to avoid service of summons or other proceeding\n\nExplanation: A person who absconds to avoid being served with a summons, notice, or order from a legally competent public servant.\n\nIllustration: -\n\nEffect: Simple imprisonment for up to 1 month or fine up to ₹5000, or both.",
  "BNS S. 206(Absconding to avoid attending Court or producing a document in Court)": "If the summons or notice relates to attending in person or by agent, or producing a document/electronic record in Court.\n\nExplanation: -\n\nIllustration: Simple imprisonment for up to 6 months or fine up to ₹10,000, or both.\n\nEffect: nan",
  "BNS S. 207": "Preventing service of summons or other proceeding, or preventing publication thereof\n\nExplanation: A person who intentionally prevents the service of any summons, notice, or order from a legally competent public servant, or prevents lawful affixing or removal of such documents.\n\nIllustration: -\n\nEffect: Simple imprisonment for up to 1 month or fine up to ₹5000, or both.",
  "BNS S. 208": "Non-attendance in obedience to an order from public servant\n\nExplanation: A person who, being legally bound to attend in person or by agent in obedience to a summons, notice, order, or proclamation, omits to attend at the required place or time or departs from the place before the lawful time to do so.\n\nIllustration: -\n\nEffect: Simple imprisonment for up to 1 month or fine up to ₹5000, or both.",
  "BNS S. 209": "Non-appearance after being declared a proclaimed offender\n\nExplanation: If the individual has been declared a proclaimed offender under sub-section (4) of section 84.\n\nIllustration: -\n\nEffect: Imprisonment for up to 7 years and fine.",
  "BNS S. 210": "Omission to produce document or electronic record to public servant by person legally bound to produce it\n\nExplanation: A person who is legally bound to produce or deliver any document or electronic record to a public servant, and intentionally omits to do so.\n\nIllustration: A, being legally bound to produce a document before a District Court, intentionally omits to produce the same.\n\nEffect: Simple imprisonment for up to 1 month or fine up to 5000 rupees, or both.",
  "BNS S. 210(Omission to produce document or electronic record to a Court)": "If the document or electronic record is to be produced or delivered to a Court.\n\nExplanation: -\n\nIllustration: Simple imprisonment for up to 6 months or fine up to 10,000 rupees, or both.\n\nEffect: nan",
  "BNS S. 211": "Omission related to an order under Section 447 of Bhartiya Nagarik Suraksha Sanhita, 2023\n\nExplanation: If the omission relates to an order under Section 447 of the Bhartiya Nagarik Suraksha Sanhita, 2023, requiring information or notice.\n\nIllustration: A, a person bound by law, fails to provide information as required by an order under Section 447.\n\nEffect: Imprisonment for up to 6 months, or fine up to 1,000 rupees, or both.",
  "BNS S. 212": "False information related to commission or prevention of an offence\n\nExplanation: If the false information concerns the commission of an offence or is required to prevent an offence or to apprehend an offender.\n\nIllustration: A, a village watchman, misinforms the police about a planned dacoity.\n\nEffect: Imprisonment for up to 2 years, or fine, or both.",
  "BNS S. 213": "Refusal to take an oath or affirmation\n\nExplanation: A person legally required to take an oath or affirmation to state the truth before a public servant refuses to do so.\n\nIllustration: A person required by law to take an oath before a court refuses to do so when asked by the judge.\n\nEffect: Simple imprisonment for up to 6 months, or a fine of up to 5000 rupees, or both.",
  "BNS S. 214": "Refusal to answer questions\n\nExplanation: A person legally required to answer a question posed by a public servant refuses to do so.\n\nIllustration: A person is questioned by a police officer under lawful authority but refuses to provide an answer.\n\nEffect: Simple imprisonment for up to 6 months, or a fine of up to 5000 rupees, or both.",
  "BNS S. 215": "Refusal to sign a statement\n\nExplanation: A person refuses to sign a statement made by him when legally required to do so by a public servant.\n\nIllustration: A person provides a statement to a police officer but refuses to sign the statement, even when asked to do so.\n\nEffect: Simple imprisonment for up to 3 months, or a fine of up to 3000 rupees, or both.",
  "BNS S. 216": "False statement on oath or affirmation\n\nExplanation: A person who, under oath or affirmation, makes a false statement to a public servant or person authorized to administer the oath or affirmation, knowing the statement is false.\n\nIllustration: A person falsely swears under oath regarding a subject in front of an investigating officer.\n\nEffect: Imprisonment of up to 3 years, and/or a fine.",
  "BNS S. 217": "False information to cause harm\n\nExplanation: A person knowingly provides false information to a public servant intending to cause harm or injury to another person.\n\nIllustration: A falsely accuses a police officer of misconduct, knowing the information will lead to an unfair dismissal.\n\nEffect: Imprisonment for up to 1 year, or a fine of up to 10,000 rupees, or both.",
  "BNS S. 218": "Resistance to lawful property seizure\n\nExplanation: A person resists the taking of property by a public servant, knowing the servant is authorized to do so.\n\nIllustration: A person resists a police officer while the officer attempts to seize property under a valid warrant.\n\nEffect: Imprisonment for up to 6 months, or a fine of up to 10,000 rupees, or both.",
  "BNS S. 219": "Obstructing sale of property\n\nExplanation: A person intentionally obstructs a sale of property offered for sale by the lawful authority of a public servant.\n\nIllustration: A person physically blocks a sale of confiscated property by the government to prevent its transfer.\n\nEffect: Imprisonment for up to 1 month, or a fine of up to 5,000 rupees, or both.",
  "BNS S. 220": "Illegal purchase or bid for property\n\nExplanation: A person purchases or bids for property at a lawful public sale, knowing they are bidding on behalf of someone legally barred from purchasing the property, or with no intent to fulfill their obligations.\n\nIllustration: A person bids for a government auction item on behalf of someone who is legally prohibited from bidding, intending not to pay.\n\nEffect: Imprisonment for up to 1 month, or a fine of up to 200 rupees, or both.",
  "BNS S. 221": "Obstructing public servant in duty\n\nExplanation: A person voluntarily obstructs a public servant from performing their duties.\n\nIllustration: A person physically prevents a police officer from carrying out an arrest, obstructing the officer’s legal functions.\n\nEffect: Imprisonment for up to 3 months, or a fine of up to 2,500 rupees, or both.",
  "BNS S. 222": "Omission to assist public servant\n\nExplanation: A person who is bound by law to assist a public servant in the execution of their duties intentionally omits to do so.\n\nIllustration: A person fails to provide help when a police officer requests it to prevent a crime.\n\nEffect: Imprisonment for up to 1 month, or a fine of up to 2,500 rupees, or both; for certain duties, imprisonment up to 6 months or a fine of up to 5,000 rupees, or both.",
  "BNS S. 223": "Disobedience to order duly promulgated by public servant\n\nExplanation: A person disobeys a lawful order of a public servant to either refrain from an act or take certain action with their property.\n\nIllustration: A person is ordered by the police to vacate a restricted area but refuses to do so.\n\nEffect: Imprisonment for up to 3 months, or a fine of up to 2,500 rupees, or both; for certain cases, imprisonment up to 1 year or fine up to 5,000 rupees, or both.",
  "BNS S. 224": "Threat of injury to public servant\n\nExplanation: A person threatens injury to a public servant or anyone the servant is interested in to induce them to do or forbear an act in their official capacity.\n\nIllustration: A person threatens a police officer’s family to prevent the officer from performing their lawful duties.\n\nEffect: Imprisonment for up to 2 years, or a fine, or both.",
  "BNS S. 225": "Threat of injury to induce person to refrain from applying for protection\n\nExplanation: A person threatens injury to induce someone to refrain from seeking legal protection from a public servant.\n\nIllustration: A person threatens an individual to prevent them from reporting abuse to the police.\n\nEffect: Imprisonment for up to 1 year, or a fine, or both.",
  "BNS S. 227": "Giving false evidence\n\nExplanation: A person who is bound by an oath or law to tell the truth or make a declaration, and intentionally makes a false statement, is giving false evidence.\n\nIllustration: A falsely swears during a trial in support of a claim. A states they believe something when they do not.\n\nEffect: Imprisonment of up to 7 years, or a fine, or both.",
  "BNS S. 226": "Attempt to commit suicide to compel or restrain public servant\n\nExplanation: A person who attempts suicide with the intent to compel or restrain any public servant from performing their official duty.\n\nIllustration: A person attempts suicide to stop the police from enforcing the law.\n\nEffect: Imprisonment for up to 1 year, or a fine, or both, or community service.",
  "BNS S. 228": "Fabricating false evidence\n\nExplanation: A person who causes a circumstance or makes a false entry or statement in any record, intending it to be used as evidence in a judicial proceeding.\n\nIllustration: A person writes a letter to falsely accuse someone or makes a false entry in a book for the purpose of influencing judicial proceedings.\n\nEffect: Imprisonment for up to 7 years, or a fine up to 10,000 rupees, or both.",
  "BNS S. 229": "Punishment for false evidence\n\nExplanation: A person who intentionally gives or fabricates false evidence in a judicial proceeding is punished.\n\nIllustration: A person makes a false statement in a court inquiry or investigation.\n\nEffect: Imprisonment for up to 7 years, or a fine up to 10,000 rupees, or both. For cases other than judicial proceedings, imprisonment up to 3 years or a fine up to 5,000 rupees, or both.",
  "BNS S. 230": "Giving or fabricating false evidence with intent to procure conviction of capital offence\n\nExplanation: A person who gives or fabricates false evidence with the intent to cause the conviction of a person for a capital offence.\n\nIllustration: Imprisonment for life or rigorous imprisonment up to 10 years, and a fine up to 50,000 rupees. If the convicted person is executed due to false evidence, the person responsible for giving the false evidence will be punished with death or the aforementioned punishment.\n\nEffect: Cognizable, Non-bailable, Triable by Court",
  "BNS S. 231": "Giving or fabricating false evidence with intent to procure conviction of offence punishable with life imprisonment or term\n\nExplanation: A person who gives or fabricates false evidence intending to cause conviction for an offence punishable with life imprisonment or a term of seven years or more.\n\nIllustration: The punishment for the person will be the same as that of the offence they intended to cause a conviction for.\n\nEffect: Non-cognizable, Non-bailable, Triable by Court of Session",
  "BNS S. 232": "Threatening any person to give false evidence\n\nExplanation: A person who threatens another to cause them to give false evidence. If the threat leads to an innocent person's conviction, the same punishment will apply to the person making the threat.\n\nIllustration: Imprisonment for up to 7 years, fine, or both. If the threat results in a conviction, the person will be punished as if they were convicted for that offence.\n\nEffect: Non-cognizable, Non-bailable, Triable by Court of Session",
  "BNS S. 236": "False statement made in declaration which is by law receivable as evidence\n\nExplanation: A person makes a false statement in a declaration legally receivable as evidence, knowing or believing it to be false.\n\nIllustration: nan\n\nEffect: Punished in the same manner as giving false evidence.",
  "BNS S. 237": "Using as true a declaration known to be false\n\nExplanation: A person uses or attempts to use a false declaration as true, knowing it is false.\n\nIllustration: nan\n\nEffect: Punished as if they gave false evidence.",
  "BNS S. 238": "Causing disappearance of evidence or giving false information to screen an offender\n\nExplanation: A person causes evidence to disappear or gives false information to hide an offender, with the intent to protect them from punishment.\n\nIllustration: A helps to hide a murder victim’s body to protect the murderer.\n\nEffect: Punishment depends on the severity of the original offence: up to 7 years and a fine for the most serious offences.",
  "BNS S. 239": "Intentional omission to give information of an offence\n\nExplanation: A person intentionally omits to give information about an offence they are legally bound to inform about.\n\nIllustration: nan\n\nEffect: Punishment: imprisonment for up to 6 months, a fine up to 5,000 rupees, or both.",
  "BNS S. 240": "Giving false information about an offence\n\nExplanation: A person gives false information about an offence they know is false.\n\nIllustration: nan\n\nEffect: Punishment: imprisonment for up to 2 years, fine, or both.",
  "BNS S. 233": "Using evidence known to be false\n\nExplanation: A person who uses or attempts to use evidence that they know is false or fabricated, as genuine, will be punished similarly to someone who gives or fabricates false evidence.\n\nIllustration: Punishment same as for giving or fabricating false evidence.\n\nEffect: Non-cognizable, Bailable or Non-bailable (based on the offence), Triable by Court of false evidence.",
  "BNS S. 234": "Issuing or signing false certificate\n\nExplanation: A person who issues or signs a certificate required by law, knowing or believing it to be false in any material point, will be punished similarly to someone who gives false evidence.\n\nIllustration: Punishment same as for giving false evidence.\n\nEffect: Non-cognizable, Bailable, Triable by Court of false evidence.",
  "BNS S. 235": "Using as true a certificate known to be false\n\nExplanation: A person who uses or attempts to use a certificate that they know to be false in any material point as if it were true, will be punished similarly to someone who gives false evidence.\n\nIllustration: Punishment same as for giving false evidence.\n\nEffect: Non-cognizable, Bailable, Triable by Court of false evidence.",
  "BNS S. 241": "Destruction of document or electronic record to prevent its production as evidence\n\nExplanation: A person destroys or conceals a document/electronic record with the intention to prevent it from being produced as evidence.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 3 years, or a fine up to 5,000 rupees, or both.",
  "BNS S. 242": "False personation for purpose of act or proceeding in suit or prosecution\n\nExplanation: A person falsely assumes another's identity and performs legal acts (e.g., making admissions, causing process to be issued).\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 3 years, a fine, or both.",
  "BNS S. 243": "Fraudulent removal or concealment of property to prevent its seizure as forfeited or in execution\n\nExplanation: A person fraudulently conceals or transfers property to prevent it from being seized as forfeiture or in execution of a decree.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 3 years, a fine up to 5,000 rupees, or both.",
  "BNS S. 244": "Fraudulent claim to property to prevent its seizure as forfeited or in execution\n\nExplanation: A person fraudulently claims property they are not entitled to, to prevent its seizure.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 2 years, a fine, or both.",
  "BNS S. 245": "Fraudulently suffering decree for sum not due\n\nExplanation: A person causes or suffers a decree to be passed fraudulently for a sum not due or a larger sum than is due.\n\nIllustration: Z suffers a judgment for a larger sum, benefiting from the proceeds of A’s decree.\n\nEffect: Punished with imprisonment for up to 2 years, a fine, or both.",
  "BNS S. 246": "Dishonestly making false claim in Court\n\nExplanation: A person fraudulently or dishonestly makes a false claim in court, intending to injure or annoy another person.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 2 years, or a fine.",
  "BNS S. 247": "Fraudulently obtaining decree for sum not due\n\nExplanation: A person fraudulently obtains a decree/order for a sum not due, or for a larger sum than is due.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 2 years, or a fine, or both.",
  "BNS S. 248": "False charge of offence made with intent to injure\n\nExplanation: A person falsely charges someone with an offence, intending to cause injury to that person.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 5 years, or a fine up to 2 lakh rupees, or both. If the offence is severe (e.g., death penalty), punishment increases to up to 10 years imprisonment, and a fine.",
  "BNS S. 249": "Harbouring offender\n\nExplanation: A person conceals or harbours an offender with the intention of screening them from legal punishment.\n\nIllustration: A harbours a person involved in dacoity to screen them from punishment.\n\nEffect: Punished with imprisonment for up to 5 years, a fine (depending on the severity of the offence), or both.",
  "BNS S. 250": "Taking gift, etc., to screen an offender from punishment\n\nExplanation: A person accepts or agrees to accept any gratification for concealing an offence or screening an offender from punishment.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 7 years (depending on the offence), a fine, or both.",
  "BNS S. 251": "Offering gift or restoration of property in consideration of screening offender\n\nExplanation: A person offers or agrees to offer a gift or restore property in exchange for concealing an offence or screening someone from legal punishment.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 7 years, a fine, or both (depending on the severity of the offence).",
  "BNS S. 252": "Taking gift to help recover stolen property\n\nExplanation: A person accepts or agrees to accept any gratification under the pretext of helping recover stolen property, without attempting to bring the offender to justice.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 2 years, a fine, or both.",
  "BNS S. 253": "Harbouring offender who has escaped from custody or whose apprehension has been ordered\n\nExplanation: A person knowingly harbours or conceals an offender who has escaped lawful custody or whose apprehension has been ordered.\n\nIllustration: nan\n\nEffect: Punished with imprisonment (up to 7 years for death-penalty cases, up to 3 years for life imprisonment cases, etc.) and may include a fine.",
  "BNS S. 254": "Penalty for harbouring robbers or dacoits\n\nExplanation: A person who harbours robbers or dacoits with the intent to facilitate or screen them from punishment is penalized.\n\nIllustration: nan\n\nEffect: Rigorous imprisonment for up to 7 years, a fine, or both.",
  "BNS S. 255": "Public servant disobeying direction of law to save person or property from punishment\n\nExplanation: A public servant disobeys the law to save someone from punishment or property from forfeiture.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 2 years, a fine, or both.",
  "BNS S. 256": "Public servant framing incorrect record or writing with intent to save person or property\n\nExplanation: A public servant frames incorrect records with the intent to save a person from punishment or property from forfeiture.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 3 years, a fine, or both.",
  "BNS S. 257": "Public servant in judicial proceeding corruptly making report, etc. contrary to law\n\nExplanation: A public servant knowingly makes a corrupt decision or report contrary to law in a judicial proceeding.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 7 years, a fine, or both.",
  "BNS S. 258": "Commitment for trial or confinement by person having authority who knows acting contrary to law\n\nExplanation: A person in authority unlawfully commits someone for trial or confinement, knowing it is against the law.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 7 years, a fine, or both.",
  "BNS S. 259": "Intentional omission to apprehend on the part of public servant bound to apprehend\n\nExplanation: A public servant intentionally omits to apprehend or assists in the escape of a person legally bound for apprehension or confinement.\n\nIllustration: nan\n\nEffect: Punished with imprisonment (up to 7 years for death penalty cases, 3 years for life imprisonment cases, etc.) with or without fine.",
  "BNS S. 260": "Intentional omission to apprehend on the part of public servant bound to apprehend person under sentence\n\nExplanation: A public servant intentionally omits to apprehend or assists in the escape of a person under sentence or lawfully committed to custody.\n\nIllustration: nan\n\nEffect: Punished with imprisonment (up to 14 years for death penalty cases, 7 years for life imprisonment cases, etc.) with or without fine.",
  "BNS S. 261": "Escape from confinement or custody negligently suffered by public servant\n\nExplanation: A public servant negligently allows a person under their custody or charged with an offence to escape.\n\nIllustration: nan\n\nEffect: Punished with simple imprisonment for up to 2 years, a fine, or both.",
  "BNS S. 262": "Resistance or obstruction by a person to his lawful apprehension\n\nExplanation: A person intentionally resists or obstructs their lawful apprehension or escapes from custody.\n\nIllustration: The punishment is in addition to the punishment for the offence they are charged with.\n\nEffect: Punished with imprisonment for up to 2 years, a fine, or both.",
  "BNS S. 263": "Resistance or obstruction to lawful apprehension of another person\n\nExplanation: A person resists or obstructs the lawful apprehension of another or attempts to rescue them from custody.\n\nIllustration: Punishment varies based on the severity of the offence for which the person is being apprehended.\n\nEffect: Punished with imprisonment for up to 2 years, or 3 years, or 7 years, depending on the offence the person is charged with, with a fine.",
  "BNS S. 264": "Omission to apprehend, or sufferance of escape, on part of public servant\n\nExplanation: A public servant omits to apprehend or allows a person to escape from confinement in cases not covered by other sections.\n\nIllustration: If done intentionally or negligently, punishment varies.\n\nEffect: Intentionally: imprisonment up to 3 years or fine, or both. Negligently: simple imprisonment up to 2 years, or fine, or both.",
  "BNS S. 265": "Resistance or obstruction to lawful apprehension or escape or rescue in cases not otherwise provided for\n\nExplanation: A person resists or obstructs their own or another's lawful apprehension or attempts to escape or rescue someone from custody in cases not covered by other sections.\n\nIllustration: nan\n\nEffect: Punished with imprisonment for up to 6 months, a fine, or both.",
  "BNS S. 266": "Violation of condition of remission of punishment\n\nExplanation: A person who violates the conditions of remission of their punishment after accepting it.\n\nIllustration: Punished with the original sentence if no part has been served; if some part has been served, the remaining punishment.\n\nEffect: Cognizable, Non-bailable, Triable by the Court of the original offence.",
  "BNS S. 267": "Intentional insult or interruption to public servant in judicial proceeding\n\nExplanation: A person intentionally insults or interrupts a public servant during a judicial proceeding.\n\nIllustration: Simple imprisonment for up to 6 months, or a fine up to 5000 rupees, or both.\n\nEffect: Non-cognizable, Bailable, Triable by the Court in which the offence is committed.",
  "BNS S. 268": "Personation of an assessor\n\nExplanation: A person intentionally impersonates or is wrongfully empanelled as an assessor in a case they are not entitled to.\n\nIllustration: Imprisonment for up to 2 years, a fine, or both.\n\nEffect: Non-cognizable, Bailable, Triable by Magistrate of the first class.",
  "BNS S. 269": "Failure by person released on bail or bond to appear in court\n\nExplanation: A person released on bail or bond fails to appear in court without sufficient cause.\n\nIllustration: Imprisonment for up to 1 year, a fine, or both.\n\nEffect: Cognizable, Non-bailable, Triable by Magistrate of the first class.",
  "BNS S. 270": "Public nuisance\n\nExplanation: A person causes a public nuisance by engaging in acts or omissions that create injury, danger, or annoyance to the public or people in general.\n\nIllustration: nan\n\nEffect: nan",
  "BNS S. 271": "Negligent act likely to spread infection of disease dangerous to life\n\nExplanation: A person unlawfully or negligently does something likely to spread a dangerous disease.\n\nIllustration: Imprisonment for up to 6 months, a fine, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 272": "Malignant act likely to spread infection of disease dangerous to life\n\nExplanation: A person malignantly does something likely to spread a dangerous disease.\n\nIllustration: Imprisonment for up to 2 years, a fine, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 273": "Disobedience to quarantine rule\n\nExplanation: A person knowingly disobeys a government rule related to quarantine of transport or places with infectious diseases.\n\nIllustration: Imprisonment for up to 6 months, a fine, or both.\n\nEffect: Non-cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 274": "Adulteration of food or drink intended for sale\n\nExplanation: A person adulterates food or drink, making it harmful for sale.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 5000 rupees, or both.\n\nEffect: Non-cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 275": "Sale of noxious food or drink\n\nExplanation: A person sells, offers, or exposes food or drink that is harmful or unfit for consumption.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 5000 rupees, or both.\n\nEffect: Non-cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 276": "Adulteration of drugs\n\nExplanation: A person adulterates a drug or medical preparation to lessen its efficacy or make it harmful, intending it to be sold or used for medicinal purposes.\n\nIllustration: Imprisonment for up to 1 year, a fine up to 5000 rupees, or both.\n\nEffect: Non-cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 277": "Sale of adulterated drugs\n\nExplanation: A person sells, offers, or exposes for sale a drug adulterated to lessen its efficacy or make it harmful, knowing it has been adulterated.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 5000 rupees, or both.\n\nEffect: Non-cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 278": "Sale of drug as a different drug or preparation\n\nExplanation: A person sells, offers, or exposes for sale any drug or medical preparation as a different drug, knowing it to be different.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 5000 rupees, or both.\n\nEffect: Non-cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 279": "Fouling water of public spring or reservoir\n\nExplanation: A person voluntarily fouls or corrupts water from a public spring or reservoir, making it less fit for its intended use.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 5000 rupees, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 280": "Making atmosphere noxious to health\n\nExplanation: A person voluntarily vitiates the atmosphere in any area, making it harmful to health.\n\nIllustration: Fine up to 1000 rupees.\n\nEffect: Non-cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 281": "Rash driving or riding on a public way\n\nExplanation: A person drives a vehicle or rides on a public way rashly or negligently, endangering human life or likely to cause injury.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 1000 rupees, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 282": "Rash navigation of vessel\n\nExplanation: A person navigates a vessel rashly or negligently, endangering human life or likely to cause injury.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 10,000 rupees, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 283": "Exhibition of false light, mark, or buoy\n\nExplanation: A person exhibits a false light, mark, or buoy that misleads a navigator.\n\nIllustration: Imprisonment for up to 7 years, and a fine of at least 10,000 rupees.\n\nEffect: Cognizable, Bailable, Triable by Magistrate of the First Class.",
  "BNS S. 284": "Conveying person by water in unsafe or overloaded vessel\n\nExplanation: A person conveys someone by water in an unsafe or overloaded vessel, endangering their life.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 5,000 rupees, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 285": "Danger or obstruction in public way or line of navigation\n\nExplanation: A person causes danger, obstruction, or injury in a public way or line of navigation.\n\nIllustration: Fine up to 5,000 rupees.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 286": "Negligent conduct with respect to poisonous substance\n\nExplanation: A person negligently or rashly handles a poisonous substance, endangering human life or likely to cause injury.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 5,000 rupees, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 287": "Negligent conduct with respect to fire or combustible matter\n\nExplanation: A person negligently or rashly handles fire or combustible matter, endangering human life or likely to cause injury.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 2,000 rupees, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 288": "Negligent conduct with respect to explosive substance\n\nExplanation: A person negligently or rashly handles an explosive substance, endangering human life or likely to cause injury.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 5,000 rupees, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 289": "Negligent conduct with respect to machinery\n\nExplanation: A person negligently or rashly handles machinery, endangering human life or likely to cause injury.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 5,000 rupees, or both.\n\nEffect: Non-cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 290": "Negligent conduct with respect to pulling down, repairing, or constructing buildings\n\nExplanation: A person negligently omits safety measures while pulling down, repairing, or constructing a building, endangering human life.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 5,000 rupees, or both.\n\nEffect: Non-cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 291": "Negligent conduct with respect to animal\n\nExplanation: A person negligently omits measures to prevent a danger from an animal in their possession that could harm human life or cause grievous injury.\n\nIllustration: Imprisonment for up to 6 months, a fine up to 5,000 rupees, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 292": "Public nuisance in cases not otherwise provided for\n\nExplanation: A person commits a public nuisance not specified in other provisions.\n\nIllustration: Fine up to 1,000 rupees.\n\nEffect: Non-cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 293": "Continuance of nuisance after injunction to discontinue\n\nExplanation: A person repeats or continues a public nuisance after being ordered by a public servant to stop.\n\nIllustration: Simple imprisonment for up to 6 months, fine up to 5,000 rupees, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 294": "Sale, etc., of obscene books, etc.\n\nExplanation: A person sells, distributes, exhibits, or circulates obscene materials or takes part in such activities.\n\nIllustration: On first conviction: Imprisonment up to 2 years, fine up to 5,000 rupees. On second or subsequent conviction: Imprisonment up to 5 years, fine up to 10,000 rupees.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 295": "Sale, etc., of obscene objects to child\n\nExplanation: A person sells, distributes, or circulates obscene materials to a child under 18 years of age or attempts to do so.\n\nIllustration: On first conviction: Imprisonment up to 3 years, fine up to 2,000 rupees. On second or subsequent conviction: Imprisonment up to 7 years, fine up to 5,000 rupees.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate",
  "BNS S. 296": "Obscene acts and songs\n\nExplanation: A person does any obscene act or sings/utters obscene songs in a public place to annoy others.\n\nIllustration: Imprisonment up to 3 months, fine up to 1,000 rupees, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 297": "Keeping lottery office\n\nExplanation: A person keeps an office for drawing a non-State or unauthorized lottery or publishes any related proposals.\n\nIllustration: Imprisonment up to 6 months, fine, or both. Fine up to 5,000 rupees for publishing lottery-related proposals.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 298": "Injuring or defiling place of worship, with intent to insult religion\n\nExplanation: A person destroys, damages, or defiles a place of worship or any sacred object with the intention or knowledge of insulting the religion.\n\nIllustration: Imprisonment up to 2 years, fine, or both.\n\nEffect: Cognizable, Non-Bailable, Triable by Any Magistrate.",
  "BNS S. 299": "Deliberate and malicious acts, intended to outrage religious feelings\n\nExplanation: A person deliberately insults or attempts to insult any religion or religious beliefs through words, signs, or representations.\n\nIllustration: Imprisonment up to 3 years, fine, or both.\n\nEffect: Cognizable, Non-Bailable, Triable by Any Magistrate.",
  "BNS S. 300": "Disturbing religious assembly\n\nExplanation: A person voluntarily disturbs an assembly lawfully engaged in religious worship or ceremonies.\n\nIllustration: Imprisonment up to 1 year, fine, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 301": "Trespassing on burial places, etc.\n\nExplanation: A person who commits trespass in places of worship, places for funeral rites, or insults human corpses with the intention of wounding religious feelings or insulting religion, or causes disturbance to funeral ceremonies.\n\nIllustration: Imprisonment for up to 1 year, or fine, or both.\n\nEffect: Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 302": "Insulting religious feelings\n\nExplanation: A person who deliberately and with malicious intention insults the religious feelings of another person through words, sounds, gestures, or objects in their sight or hearing.\n\nIllustration: Imprisonment for up to 1 year, or fine, or both.\n\nEffect: Non-Cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 303": "Theft\n\nExplanation: A person commits theft by dishonestly taking any movable property without the consent of the owner, moving it with the intention to take it away. It includes specific examples of theft with animals and objects.\n\nIllustration: Imprisonment for up to 3 years, or fine, or both. In the case of a second conviction, imprisonment between 1 to 5 years and fine. For theft involving property less than 5,000 rupees, the first-time offender may be punished with community service.\n\nEffect: Cognizable, Non-Bailable, Triable by Any Magistrate.",
  "BNS S. 304": "Snatching\n\nExplanation: Snatching is defined as theft where the offender quickly or forcibly seizes, grabs, or takes away any movable property from another person or their possession.\n\nIllustration: Imprisonment for up to 3 years and liable to fine.\n\nEffect: Cognizable, Non-Bailable, Triable by Any Magistrate.",
  "BNS S. 305": "Theft in a dwelling house, means of transport, or place of worship, etc.\n\nExplanation: Theft committed in any building used as a human dwelling, for the custody of property, in means of transport, or from a place of worship or any property of the Government or local authority.\n\nIllustration: Imprisonment for up to 7 years and liable to fine.\n\nEffect: Cognizable, Non-Bailable, Triable by Any Magistrate.",
  "BNS S. 306": "Theft by clerk or servant\n\nExplanation: Theft committed by a clerk or servant involving property in their employer’s possession.\n\nIllustration: Imprisonment for up to 7 years and liable to fine.\n\nEffect: Cognizable, Non-bailable, Triable by Any Magistrate.",
  "BNS S. 307": "Theft after preparation for causing death, hurt, or restraint\n\nExplanation: Theft committed after preparing to cause death, hurt, or restraint to anyone involved in the theft or its aftermath.\n\nIllustration: Rigorous imprisonment for up to 10 years and liable to fine.\n\nEffect: Cognizable, Non-bailable, Triable by Any Magistrate.",
  "BNS S. 308(1)": "Extortion\n\nExplanation: Putting someone in fear of injury to induce them to deliver property, money, or valuables.\n\nIllustration: Imprisonment for up to 7 years or fine or both.\n\nEffect: Cognizable, Non-bailable, Triable by Any Magistrate.",
  "BNS S. 308(2)": "Extortion (Fear of injury)\n\nExplanation: Putting someone in fear of injury to induce them to deliver property or valuables.\n\nIllustration: Imprisonment for up to 2 years or fine or both.\n\nEffect: Cognizable, Non-bailable, Triable by Any Magistrate.",
  "BNS S. 308(3)": "Extortion (Fear of death or grievous hurt)\n\nExplanation: Putting someone in fear of death or grievous hurt to induce delivery of property or valuables.\n\nIllustration: Imprisonment for up to 7 years and liable to fine.\n\nEffect: Cognizable, Non-bailable, Triable by Any Magistrate.",
  "BNS S. 308(4)": "Extortion (Fear of death or grievous hurt)\n\nExplanation: Committing extortion by putting someone in fear of death or grievous hurt.\n\nIllustration: Imprisonment for up to 10 years and liable to fine.\n\nEffect: Cognizable, Non-bailable, Triable by Any Magistrate.",
  "BNS S. 308(5)": "Extortion (Fear of accusation of severe crime)\n\nExplanation: Putting someone in fear of accusation of a serious crime to induce delivery of property or valuables.\n\nIllustration: Imprisonment for up to 10 years and liable to fine.\n\nEffect: Cognizable, Non-bailable, Triable by Any Magistrate.",
  "BNS S. 308(6)": "Extortion (Fear of accusation of severe crime)\n\nExplanation: Committing extortion by putting someone in fear of being accused of a severe crime.\n\nIllustration: Imprisonment for up to 10 years and liable to fine.\n\nEffect: Cognizable, Non-bailable, Triable by Any Magistrate.",
  "BNS S. 309": "Robbery with hurt\n\nExplanation: If hurt is caused in committing or attempting robbery.\n\nIllustration: Life imprisonment or rigorous imprisonment up to 10 years, liable to fine.\n\nEffect: Cognizable, Non-bailable, Triable by Any Magistrate.",
  "BNS S. 310": "Being part of a gang for dacoity\n\nExplanation: Being part of a gang habitually committing dacoity.\n\nIllustration: Life imprisonment or rigorous imprisonment up to 10 years, liable to fine.\n\nEffect: Cognizable, Non-bailable, Triable by Any Magistrate",
  "BNS S. 311": "Robbery or dacoity with attempt to cause death or grievous hurt\n\nExplanation: Using deadly weapons, causing grievous hurt, or attempting to cause death or grievous hurt during robbery or dacoity.\n\nIllustration: Imprisonment not less than 7 years, liable to fine.\n\nEffect: Cognizable, Non-bailable, Triable by Court of Session.",
  "BNS S. 312": "Attempt to commit robbery or dacoity with deadly weapon\n\nExplanation: Attempting robbery or dacoity while armed with a deadly weapon.\n\nIllustration: Imprisonment not less than 7 years.\n\nEffect: Cognizable, Non-bailable, Triable by Court of Session.",
  "BNS S. 313": "Belonging to a gang of robbers\n\nExplanation: Belonging to a gang associated in habitually committing theft or robbery (not dacoity).\n\nIllustration: Rigorous imprisonment up to 7 years, liable to fine.\n\nEffect: Cognizable, Non-bailable, Triable by Magistrate of the First Class.",
  "BNS S. 314": "Dishonest misappropriation of property\n\nExplanation: Dishonestly misappropriating or converting movable property to one’s own use.\n\nIllustration: Imprisonment not less than 6 months, up to 2 years, and fine.\n\nEffect: Non-cognizable, Bailable, Triable by Any Magistrate.",
  "BNS S. 315": "Dishonest misappropriation of property possessed by deceased person at the time of his death\n\nExplanation: Dishonestly misappropriating property of a deceased person, knowing the property was in the possession of the deceased at the time of death and hasn’t been legally possessed by anyone else. If the offender was employed as a servant or clerk, the punishment increases.\n\nIllustration: Imprisonment up to 3 years, liable to fine. If the offender was employed by the deceased, imprisonment up to 7 years, liable to fine.\n\nEffect: Non-cognizable, Bailable, Triable by Magistrate of the First Class.",
  "BNS S. 316(Criminal breach of trust)": "Dishonestly misappropriating or converting property entrusted to you, violating legal trust agreements\n\nExplanation: Imprisonment up to 5 years, fine, or both. For specific cases (like a carrier, warehouse keeper, or public servant), punishment increases to up to 7 years or life imprisonment\n\nIllustration: Non-cognizable, Bailable, Triable by Magistrate of the First Class\n\nEffect: nan",
  "BNS S. 317(Stolen property)": "Receiving, retaining, or dealing with stolen property, knowing it to be stolen\n\nExplanation: Imprisonment up to 3 years, fine, or both. If from dacoity, imprisonment up to 10 years or life, and fine\n\nIllustration: Non-cognizable, Bailable, Triable by Magistrate\n\nEffect: nan",
  "BNS S. 318(Cheating)": "Deceptively inducing someone to deliver property or act, causing harm\n\nExplanation: Imprisonment up to 3 years, fine, or both. If more severe harm, punishment increases to up to 5 years. If inducing delivery of property or alteration of valuable securities, punishment extends to 7 years with fine\n\nIllustration: Non-cognizable, Bailable, Triable by Magistrate\n\nEffect: nan",
  "BNS S. 319(Cheating by personation)": "Cheating by pretending to be another person, or substituting a person or identity\n\nExplanation: Imprisonment up to 5 years, fine, or both\n\nIllustration: Cognizable, Bailable, Triable by Any Magistrate\n\nEffect: nan",
  "BNS S. 320(Fraudulent removal or concealment of property)": "Dishonestly or fraudulently removing or concealing property to prevent its distribution among creditors\n\nExplanation: Imprisonment of at least 6 months, up to 2 years, fine, or both\n\nIllustration: Non-cognizable, Bailable, Triable by Any Magistrate\n\nEffect: nan",
  "BNS S. 321": "Dishonestly or fraudulently preventing a debt or demand from being made available for payment of debts\n\nExplanation: Preventing the lawful process of using a debt to pay debts\n\nIllustration: Hiding an owed amount required to pay off a debt, preventing a creditor from collecting it\n\nEffect: Punishable with imprisonment up to two years, a fine, or both",
  "BNS S. 322": "Signing or becoming a party to a deed with a false statement about the consideration for a transfer\n\nExplanation: False representation of the consideration for a property transfer\n\nIllustration: Signing a property transfer deed with an inflated price to avoid tax\n\nEffect: Punishable with imprisonment up to three years, a fine, or both",
  "BNS S. 323": "Dishonestly or fraudulently removing or concealing property belonging to oneself or another\n\nExplanation: Wrongful concealment or removal of property to avoid debts or legal claims\n\nIllustration: Hiding or removing assets to avoid creditors\n\nEffect: Punishable with imprisonment up to three years, a fine, or both",
  "BNS S. 324": "Causing wrongful loss or damage to any property\n\nExplanation: Damaging or changing property in a way that causes harm\n\nIllustration: Burning a security or damaging crops intentionally\n\nEffect: Punishable with imprisonment from six months to five years, depending on the extent of damage, with fines",
  "BNS S. 325": "Killing, poisoning, maiming, or rendering an animal useless\n\nExplanation: Harm done to an animal with intent to cause damage or destruction\n\nIllustration: Poisoning or maiming an animal\n\nEffect: Punishable with imprisonment up to five years, a fine, or both",
  "BNS S. 326": "Mischief by injury, inundation, fire, or explosive substance\n\nExplanation: Various acts causing damage or disruption to public or private property, or dangerous acts involving fire/explosives\n\nIllustration: Damaging water supplies, obstructing public roads, or destroying landmarks\n\nEffect: Punishable with imprisonment of up to five years, fine, or both; in certain cases, imprisonment of up to 10 years, or life imprisonment with fine",
  "BNS S. 327": "Mischief with intent to destroy or make unsafe rail, aircraft, or vessel\n\nExplanation: Causing damage to rail, aircraft, or large vessels intending to make them unsafe\n\nIllustration: Damaging a train or airplane to make it unsafe\n\nEffect: Punishable with imprisonment up to 10 years, or life imprisonment with fine",
  "BNS S. 328": "Running a vessel aground or ashore to commit theft\n\nExplanation: Intentionally running a vessel aground to steal property\n\nIllustration: Running a ship aground to steal cargo\n\nEffect: Punishable with imprisonment of up to 10 years, fine, or both",
  "BNS S. 329": "Criminal trespass and house-trespass\n\nExplanation: Entering property with intent to commit an offence or to intimidate or insult the person in possession\n\nIllustration: Entering a private property without permission\n\nEffect: Criminal trespass punishable with imprisonment up to three months, fine up to ₹5,000, or both; House-trespass punishable with imprisonment up to one year, fine up to ₹5,000, or both",
  "BNS S. 330": "House-trespass and house-breaking\n\nExplanation: Committing house-trespass with intent to conceal actions or breaking into a house using force or illegal means\n\nIllustration: Entering a house by force, using a hidden key, or through a broken wall\n\nEffect: House-trespass punishable with imprisonment up to one year, fine up to ₹5,000, or both; House-breaking punishable with more severe penalties depending on the method",
  "BNS S. 331": "Punishment for house-trespass or house-breaking\n\nExplanation: Committing house-trespass or house-breaking in various circumstances\n\nIllustration: Lurking house-trespass, breaking in after sunset, or intending to commit another offense\n\nEffect: Punishable with imprisonment up to 14 years, fine, or both depending on the situation (e.g., causing grievous hurt, preparation for assault, etc.)",
  "BNS S. 332": "House-trespass in order to commit an offence\n\nExplanation: Committing house-trespass to commit an offense punishable by death, life imprisonment, or imprisonment\n\nIllustration: Breaking into a house to commit a serious crime such as murder or theft\n\nEffect: Imprisonment for life, up to 10 years, or up to 2 years depending on the intended offense; if theft, imprisonment may extend to 7 years",
  "BNS S. 333": "Cognizable, Non-bailable, Triable by Any Magistrate\n\nExplanation: Classification based on the severity of the offence\n\nIllustration: -\n\nEffect: Imprisonment for 7 years, or fine.",
  "BNS S. 334": "Dishonestly breaking open receptacle containing property\n\nExplanation: Dishonest breaking or unfastening a closed receptacle containing property with intent to commit mischief or fraud\n\nIllustration: A breaks open a box he believes contains money to steal from it\n\nEffect: Imprisonment of up to 2 years, or fine, or both. If entrusted, up to 3 years, or fine, or both.",
  "BNS S. 335": "Making a false document\n\nExplanation: Dishonestly or fraudulently making, altering, or signing a document to deceive someone, including creating false electronic records\n\nIllustration: A alters a cheque to increase the amount fraudulently\n\nEffect: Various forms of punishment, including imprisonment and fines, depending on intent and fraud type.",
  "BNS S. 336": "Forgery\n\nExplanation: Making a false document or electronic record with intent to cause harm or fraud\n\nIllustration: A forges a contract to deceive someone into giving him money\n\nEffect: Imprisonment of up to 2 years, or fine, or both. If used for cheating, up to 7 years; if harming reputation, up to 3 years.",
  "BNS S. 337": "Forgery of record of Court or of public register\n\nExplanation: Forging documents like court records, voter IDs, Aadhaar, or public servant certificates\n\nIllustration: A forges a court ruling to affect a legal case\n\nEffect: Imprisonment of up to 7 years, and a fine.",
  "BNS S. 338": "Forgery of valuable security, will, etc.\n\nExplanation: Forging valuable securities, wills, or documents related to the transfer of property\n\nIllustration: A forges a will to claim an inheritance\n\nEffect: Imprisonment for life, or up to 10 years, and a fine.",
  "BNS S. 339": "Possession of forged document with intent to use it\n\nExplanation: Possessing forged documents with intent to use them as genuine\n\nIllustration: A possesses a forged will intending to use it for property transfer\n\nEffect: Imprisonment of up to 7 years (if document is in S. 335 or 336), or life imprisonment (if document is in S. 337 or 338), and a fine.",
  "BNS S. 340": "Using a forged document as genuine\n\nExplanation: Using a forged document or electronic record as if it were real\n\nIllustration: A presents a forged ID as genuine\n\nEffect: Same punishment as if the document was forged by the person, i.e., as per the forgery punishment.",
  "BNS S. 341": "Making or possessing counterfeit seal, etc., with intent to commit forgery\n\nExplanation: Making or possessing counterfeit seals, plates, or instruments to commit forgery punishable under section 338\n\nIllustration: A counterfeits a seal to forge a valuable security\n\nEffect: Imprisonment for life, or up to 7 years, and fine.",
  "BNS S. 342": "Counterfeiting device or mark used for authenticating documents\n\nExplanation: Counterfeiting devices or marks used to authenticate documents, or possessing counterfeit materials\n\nIllustration: A counterfeits a government stamp on a forged document\n\nEffect: Imprisonment for life, or up to 7 years, and fine.",
  "BNS S. 343": "Fraudulent cancellation, destruction, etc., of will, authority to adopt, or valuable security\n\nExplanation: Fraudulently cancelling, destroying, defacing, or secreting any will, authority to adopt, or valuable security\n\nIllustration: A destroys a will to claim inheritance fraudulently\n\nEffect: Imprisonment for life, or up to 7 years, and fine.",
  "BNS S. 344": "Falsification of accounts\n\nExplanation: Falsifying any book, account, or record with intent to defraud\n\nIllustration: A alters a company’s accounts to embezzle funds\n\nEffect: Imprisonment for up to 7 years, or fine, or both.",
  "BNS S. 345": "Property mark\n\nExplanation: Using or marking property with a false property mark to cause belief it belongs to someone else\n\nIllustration: A marks a package to mislead others into thinking it contains valuable goods\n\nEffect: Imprisonment for up to 1 year, or fine, or both.",
  "BNS S. 346": "Tampering with property mark with intent to cause injury\n\nExplanation: Removing, destroying, defacing, or adding to any property mark intending to cause injury\n\nIllustration: A alters a property mark on goods to mislead others into believing it belongs to someone else\n\nEffect: Imprisonment for up to 1 year, or fine, or both.",
  "BNS S. 347": "Counterfeiting a property mark\n\nExplanation: Counterfeiting a property mark used by any other person\n\nIllustration: A counterfeits a property mark of a brand to sell fake goods\n\nEffect: Imprisonment for up to 2 years, or fine, or both.",
  "BNS S. 348": "Making or possession of any instrument for counterfeiting a property mark\n\nExplanation: Possessing instruments used for counterfeiting property marks\n\nIllustration: A possesses a die used to counterfeit a property mark on goods\n\nEffect: Imprisonment for up to 3 years, or fine, or both.",
  "BNS S. 349": "Selling goods marked with a counterfeit property mark\n\nExplanation: Selling goods with counterfeit property marks\n\nIllustration: A sells goods with a fake brand label, unaware of its counterfeit nature\n\nEffect: Imprisonment for up to 1 year, or fine, or both.",
  "BNS S. 350": "Making a false mark upon any receptacle containing goods\n\nExplanation: Making a false mark on a container to mislead others\n\nIllustration: A marks a box to make it seem it contains a different item\n\nEffect: Imprisonment for up to 3 years, or fine, or both.",
  "BNS S. 351": "Criminal intimidation\n\nExplanation: Threatening harm to cause alarm or force action\n\nIllustration: A threatens B to prevent them from testifying in a court case\n\nEffect: Imprisonment for up to 2 years, or fine, or both.",
  "BNS S. 351 (2)": "Criminal intimidation with severe threats\n\nExplanation: Threatening death, grievous harm, or property destruction\n\nIllustration: A threatens B with death unless they comply\n\nEffect: Imprisonment for up to 7 years, or fine, or both.",
  "BNS S. 351 (3)": "Criminal intimidation by anonymous communication\n\nExplanation: Threatening through anonymous or concealed means\n\nIllustration: A sends an anonymous letter threatening harm to B\n\nEffect: Imprisonment for up to 2 years, in addition to the punishment in subsection (1).",
  "BNS S. 352": "Intentional insult with intent to provoke breach of peace\n\nExplanation: Intentionally insulting someone to provoke a breach of peace or another offence\n\nIllustration: A insults B to provoke a violent reaction, disturbing public peace\n\nEffect: Imprisonment for up to 2 years, or fine, or both.",
  "BNS S. 353": "Statements conducing to public mischief\n\nExplanation: Making or circulating false information or rumours to cause mutiny, fear, or incite violence\n\nIllustration: A spreads false rumours about a religious group, inciting violence\n\nEffect: Imprisonment for up to 3 years, or fine, or both.",
  "BNS S. 353 (2)": "Promoting enmity between groups\n\nExplanation: Creating enmity or ill-will between communities through false statements\n\nIllustration: A spreads a false report causing hatred between two communities\n\nEffect: Imprisonment for up to 3 years, or fine, or both.",
  "BNS S. 353 (3)": "Offence in place of worship\n\nExplanation: Committing the offence in a religious place or ceremony\n\nIllustration: A spreads a false report in a mosque, causing disturbance\n\nEffect: Imprisonment for up to 5 years, and liable to fine.",
  "BNS S. 354": "Act caused by inducing person to believe in Divine displeasure\n\nExplanation: Inducing someone to perform or omit an act by threatening divine punishment\n\nIllustration: A induces B to sit dharna by threatening divine displeasure\n\nEffect: Imprisonment for up to 1 year, or fine, or both.",
  "BNS S. 355": "Misconduct in public by a drunken person\n\nExplanation: A drunken person causing annoyance in a public place\n\nIllustration: A behaves aggressively in public while intoxicated, causing public discomfort\n\nEffect: Simple imprisonment for up to 24 hours, or fine up to 1,000 rupees, or both, or community service.",
  "BNS S. 356": "Defamation\n\nExplanation: Making defamatory statements intended to harm a person’s reputation.\n\nIllustration: - A says “Z is an honest man; he never stole B’s watch,” intending to imply that Z stole the watch.\n\nEffect: Punishment: Imprisonment (up to 2 years), fine, or both.",
  "BNS S. 357": "Breach of contract\n\nExplanation: Voluntarily omitting to fulfill a lawful contract to care for a helpless person due to youth, mental illness, or bodily weakness.\n\nIllustration: - A, bound by a contract to care for a helpless person, neglects their duties.\n\nEffect: Punishment: Imprisonment (up to 3 months), fine (up to 5,000 rupees), or both.",
  "BNS S. 358": "Repeal and savings\n\nExplanation: The Indian Penal Code is repealed but provisions continue to affect rights, privileges, liabilities, and ongoing investigations.\n\nIllustration: - No example provided as it pertains to the legal transition.\n\nEffect: Anything done under the repealed code is deemed done under corresponding provisions of the new code."
}